ExcessiveOverkill/drive-software-dev/stm32f413xx_Reg_Init.c
#include "stm32f413xx.h"

void Init(void)
{

  ADC1->SR = 0x0000;    /*!< ADC status register,                         Address offset: 0x00 */
  ADC1->CR1 = 0x0000;   /*!< ADC control register 1,                      Address offset: 0x04 */
  ADC1->CR2 = 0x0000;   /*!< ADC control register 2,                      Address offset: 0x08 */
  ADC1->SMPR1 = 0x0000; /*!< ADC sample time register 1,                  Address offset: 0x0C */
  ADC1->SMPR2 = 0x0000; /*!< ADC sample time register 2,                  Address offset: 0x10 */
  ADC1->JOFR1 = 0x0000; /*!< ADC injected channel data offset register 1, Address offset: 0x14 */
  ADC1->JOFR2 = 0x0000; /*!< ADC injected channel data offset register 2, Address offset: 0x18 */
  ADC1->JOFR3 = 0x0000; /*!< ADC injected channel data offset register 3, Address offset: 0x1C */
  ADC1->JOFR4 = 0x0000; /*!< ADC injected channel data offset register 4, Address offset: 0x20 */
  ADC1->HTR = 0x0000;   /*!< ADC watchdog higher threshold register,      Address offset: 0x24 */
  ADC1->LTR = 0x0000;   /*!< ADC watchdog lower threshold register,       Address offset: 0x28 */
  ADC1->SQR1 = 0x0000;  /*!< ADC regular sequence register 1,             Address offset: 0x2C */
  ADC1->SQR2 = 0x0000;  /*!< ADC regular sequence register 2,             Address offset: 0x30 */
  ADC1->SQR3 = 0x0000;  /*!< ADC regular sequence register 3,             Address offset: 0x34 */
  ADC1->JSQR = 0x0000;  /*!< ADC injected sequence register,              Address offset: 0x38 */
  ADC1->JDR1 = 0x0000;  /*!< ADC injected data register 1,                Address offset: 0x3C */
  ADC1->JDR2 = 0x0000;  /*!< ADC injected data register 2,                Address offset: 0x40 */
  ADC1->JDR3 = 0x0000;  /*!< ADC injected data register 3,                Address offset: 0x44 */
  ADC1->JDR4 = 0x0000;  /*!< ADC injected data register 4,                Address offset: 0x48 */
  ADC1->DR = 0x0000;    /*!< ADC regular data register,                   Address offset: 0x4C */

  ADC1_COMMON->CSR; /*!< ADC Common status register,                  Address offset: ADC1 base address + 0x300 */
  ADC1_COMMON->CCR; /*!< ADC common control register,                 Address offset: ADC1 base address + 0x304 */
  ADC1_COMMON->CDR; /*!< ADC common regular data register for dual
                          AND triple modes,                            Address offset: ADC1 base address + 0x308 */

  /**
   * @brief Controller Area Network
   */

  CAN1->MCR;                     /*!< CAN master control register,                           Address offset: 0x00  */
  CAN1->MSR;                     /*!< CAN master status register,                            Address offset: 0x04  */
  CAN1->TSR;                     /*!< CAN transmit status register,                          Address offset: 0x08  */
  CAN1->RF0R;                    /*!< CAN receive FIFO 0 register,                           Address offset: 0x0C  */
  CAN1->RF1R;                    /*!< CAN receive FIFO 1 register,                           Address offset: 0x10  */
  CAN1->IER;                     /*!< CAN interrupt enable register,                         Address offset: 0x14  */
  CAN1->ESR;                     /*!< CAN error status register,                             Address offset: 0x18  */
  CAN1->BTR;                     /*!< CAN bit timing register,                               Address offset: 0x1C  */
  CAN1->sTxMailBox[0].TIR;       /*!< CAN TX mailbox 0 identifier register,                  Address offset: 0x180 */
  CAN1->sTxMailBox[0].TDTR;      /*!< CAN TX mailbox 0 data len ctrl & time stamp reg,       Address offset: 0x184 */
  CAN1->sTxMailBox[0].TDLR;      /*!< CAN Tx mailbox 0 data low register,                    Address offset: 0x188 */
  CAN1->sTxMailBox[0].TDHR;      /*!< CAN Tx mailbox 0 data high register,                   Address offset: 0x18C */
  CAN1->sTxMailBox[1].TIR;       /*!< CAN TX mailbox 1 identifier register,                  Address offset: 0x190 */
  CAN1->sTxMailBox[1].TDTR;      /*!< CAN TX mailbox 1 data len ctrl & time stamp reg,       Address offset: 0x194 */
  CAN1->sTxMailBox[1].TDLR;      /*!< CAN Tx mailbox 1 data low register,                    Address offset: 0x198 */
  CAN1->sTxMailBox[1].TDHR;      /*!< CAN Tx mailbox 1 data high register,                   Address offset: 0x19C */
  CAN1->sTxMailBox[2].TIR;       /*!< CAN TX mailbox 2 identifier register,                  Address offset: 0x1A0 */
  CAN1->sTxMailBox[2].TDTR;      /*!< CAN TX mailbox 2 data len ctrl & time stamp reg,       Address offset: 0x1A4 */
  CAN1->sTxMailBox[2].TDLR;      /*!< CAN Tx mailbox 2 data low register,                    Address offset: 0x1A8 */
  CAN1->sTxMailBox[2].TDHR;      /*!< CAN Tx mailbox 2 data high register,                   Address offset: 0x1AC */
  CAN1->sFIFOMailBox[0].RIR;     /*!< CAN RX FIFO mailbox 0 identifier register,             Address offset: 0x1B0 */
  CAN1->sFIFOMailBox[0].RDTR;    /*!< CAN RX FIFO mailbox 0 data len ctrl & time stamp reg,  Address offset: 0x1B4 */
  CAN1->sFIFOMailBox[0].RDLR;    /*!< CAN RX FIFO mailbox 0 data low register,               Address offset: 0x1B8 */
  CAN1->sFIFOMailBox[0].RDHR;    /*!< CAN RX FIFO mailbox 0 data high register,              Address offset: 0x1BC */
  CAN1->sFIFOMailBox[1].RIR;     /*!< CAN RX FIFO mailbox 1 identifier register,             Address offset: 0x1C0 */
  CAN1->sFIFOMailBox[1].RDTR;    /*!< CAN RX FIFO mailbox 1 data len ctrl & time stamp reg,  Address offset: 0x1C4 */
  CAN1->sFIFOMailBox[1].RDLR;    /*!< CAN RX FIFO mailbox 1 data low register,               Address offset: 0x1C8 */
  CAN1->sFIFOMailBox[1].RDHR;    /*!< CAN RX FIFO mailbox 1 data high register,              Address offset: 0x1CC */
  CAN1->FMR;                     /*!< CAN filter master register,                            Address offset: 0x200 */
  CAN1->FM1R;                    /*!< CAN filter mode register,                              Address offset: 0x204 */
  CAN1->FS1R;                    /*!< CAN filter scale register,                             Address offset: 0x20C */
  CAN1->FFA1R;                   /*!< CAN filter FIFO assignment register,                   Address offset: 0x214 */
  CAN1->FA1R;                    /*!< CAN filter activation register,                        Address offset: 0x21C */
  CAN1->sFilterRegister[0].FR1;  /*!< CAN Filter 0 Filter bank register 1,                   Address offset: 0x240 */
  CAN1->sFilterRegister[0].FR2;  /*!< CAN Filter 0 Filter bank register 2,                   Address offset: 0x244 */
  CAN1->sFilterRegister[1].FR1;  /*!< CAN Filter 1 Filter bank register 1,                   Address offset: 0x248 */
  CAN1->sFilterRegister[1].FR2;  /*!< CAN Filter 1 Filter bank register 2,                   Address offset: 0x24C */
  CAN1->sFilterRegister[2].FR1;  /*!< CAN Filter 2 Filter bank register 1,                   Address offset: 0x250 */
  CAN1->sFilterRegister[2].FR2;  /*!< CAN Filter 2 Filter bank register 2,                   Address offset: 0x254 */
  CAN1->sFilterRegister[3].FR1;  /*!< CAN Filter 3 Filter bank register 1,                   Address offset: 0x258 */
  CAN1->sFilterRegister[3].FR2;  /*!< CAN Filter 3 Filter bank register 2,                   Address offset: 0x25C */
  CAN1->sFilterRegister[4].FR1;  /*!< CAN Filter 4 Filter bank register 1,                   Address offset: 0x260 */
  CAN1->sFilterRegister[4].FR2;  /*!< CAN Filter 4 Filter bank register 2,                   Address offset: 0x264 */
  CAN1->sFilterRegister[5].FR1;  /*!< CAN Filter 5 Filter bank register 1,                   Address offset: 0x268 */
  CAN1->sFilterRegister[5].FR2;  /*!< CAN Filter 5 Filter bank register 2,                   Address offset: 0x26C */
  CAN1->sFilterRegister[6].FR1;  /*!< CAN Filter 6 Filter bank register 1,                   Address offset: 0x270 */
  CAN1->sFilterRegister[6].FR2;  /*!< CAN Filter 6 Filter bank register 2,                   Address offset: 0x274 */
  CAN1->sFilterRegister[7].FR1;  /*!< CAN Filter 7 Filter bank register 1,                   Address offset: 0x278 */
  CAN1->sFilterRegister[7].FR2;  /*!< CAN Filter 7 Filter bank register 2,                   Address offset: 0x27C */
  CAN1->sFilterRegister[8].FR1;  /*!< CAN Filter 8 Filter bank register 1,                   Address offset: 0x280 */
  CAN1->sFilterRegister[8].FR2;  /*!< CAN Filter 8 Filter bank register 2,                   Address offset: 0x284 */
  CAN1->sFilterRegister[9].FR1;  /*!< CAN Filter 9 Filter bank register 1,                   Address offset: 0x288 */
  CAN1->sFilterRegister[9].FR2;  /*!< CAN Filter 9 Filter bank register 2,                   Address offset: 0x28C */
  CAN1->sFilterRegister[10].FR1; /*!< CAN Filter 10 Filter bank register 1,                  Address offset: 0x290 */
  CAN1->sFilterRegister[10].FR2; /*!< CAN Filter 10 Filter bank register 2,                  Address offset: 0x294 */
  CAN1->sFilterRegister[11].FR1; /*!< CAN Filter 11 Filter bank register 1,                  Address offset: 0x298 */
  CAN1->sFilterRegister[11].FR2; /*!< CAN Filter 11 Filter bank register 2,                  Address offset: 0x29C */
  CAN1->sFilterRegister[12].FR1; /*!< CAN Filter 12 Filter bank register 1,                  Address offset: 0x2A0 */
  CAN1->sFilterRegister[12].FR2; /*!< CAN Filter 12 Filter bank register 2,                  Address offset: 0x2A4 */
  CAN1->sFilterRegister[13].FR1; /*!< CAN Filter 13 Filter bank register 1,                  Address offset: 0x2A8 */
  CAN1->sFilterRegister[13].FR2; /*!< CAN Filter 13 Filter bank register 2,                  Address offset: 0x2AC */
  CAN1->sFilterRegister[14].FR1; /*!< CAN Filter 14 Filter bank register 1,                  Address offset: 0x2B0 */
  CAN1->sFilterRegister[14].FR2; /*!< CAN Filter 14 Filter bank register 2,                  Address offset: 0x2B4 */
  CAN1->sFilterRegister[15].FR1; /*!< CAN Filter 15 Filter bank register 1,                  Address offset: 0x2B8 */
  CAN1->sFilterRegister[15].FR2; /*!< CAN Filter 15 Filter bank register 2,                  Address offset: 0x2BC */
  CAN1->sFilterRegister[16].FR1; /*!< CAN Filter 16 Filter bank register 1,                  Address offset: 0x2C0 */
  CAN1->sFilterRegister[16].FR2; /*!< CAN Filter 16 Filter bank register 2,                  Address offset: 0x2C4 */
  CAN1->sFilterRegister[17].FR1; /*!< CAN Filter 17 Filter bank register 1,                  Address offset: 0x2C8 */
  CAN1->sFilterRegister[17].FR2; /*!< CAN Filter 17 Filter bank register 2,                  Address offset: 0x2CC */
  CAN1->sFilterRegister[18].FR1; /*!< CAN Filter 18 Filter bank register 1,                  Address offset: 0x2D0 */
  CAN1->sFilterRegister[18].FR2; /*!< CAN Filter 18 Filter bank register 2,                  Address offset: 0x2D4 */
  CAN1->sFilterRegister[19].FR1; /*!< CAN Filter 19 Filter bank register 1,                  Address offset: 0x2D8 */
  CAN1->sFilterRegister[19].FR2; /*!< CAN Filter 19 Filter bank register 2,                  Address offset: 0x2DC */
  CAN1->sFilterRegister[20].FR1; /*!< CAN Filter 20 Filter bank register 1,                  Address offset: 0x2E0 */
  CAN1->sFilterRegister[20].FR2; /*!< CAN Filter 20 Filter bank register 2,                  Address offset: 0x2E4 */
  CAN1->sFilterRegister[21].FR1; /*!< CAN Filter 21 Filter bank register 1,                  Address offset: 0x2E8 */
  CAN1->sFilterRegister[21].FR2; /*!< CAN Filter 21 Filter bank register 2,                  Address offset: 0x2EC */
  CAN1->sFilterRegister[22].FR1; /*!< CAN Filter 22 Filter bank register 1,                  Address offset: 0x2F0 */
  CAN1->sFilterRegister[22].FR2; /*!< CAN Filter 22 Filter bank register 2,                  Address offset: 0x2F4 */
  CAN1->sFilterRegister[23].FR1; /*!< CAN Filter 23 Filter bank register 1,                  Address offset: 0x2F8 */
  CAN1->sFilterRegister[23].FR2; /*!< CAN Filter 23 Filter bank register 2,                  Address offset: 0x2FC */
  CAN1->sFilterRegister[24].FR1; /*!< CAN Filter 24 Filter bank register 1,                  Address offset: 0x300 */
  CAN1->sFilterRegister[24].FR2; /*!< CAN Filter 24 Filter bank register 2,                  Address offset: 0x304 */
  CAN1->sFilterRegister[25].FR1; /*!< CAN Filter 25 Filter bank register 1,                  Address offset: 0x308 */
  CAN1->sFilterRegister[25].FR2; /*!< CAN Filter 25 Filter bank register 2,                  Address offset: 0x30C */
  CAN1->sFilterRegister[26].FR1; /*!< CAN Filter 26 Filter bank register 1,                  Address offset: 0x310 */
  CAN1->sFilterRegister[26].FR2; /*!< CAN Filter 26 Filter bank register 2,                  Address offset: 0x314 */
  CAN1->sFilterRegister[27].FR1; /*!< CAN Filter 27 Filter bank register 1,                  Address offset: 0x318 */
  CAN1->sFilterRegister[27].FR2; /*!< CAN Filter 27 Filter bank register 2,                  Address offset: 0x31C */
  // CAN_TypeDef;

  /**
   * @brief CRC calculation unit
   */

  CRC->DR;  /*!< CRC Data register,             Address offset: 0x00 */
  CRC->IDR; /*!< CRC Independent data register, Address offset: 0x04 */
  CRC->CR;  /*!< CRC Control register,          Address offset: 0x08 */
  // CRC_TypeDef;

  DFSDM1_Filter0->FLTCR1;     /*!< DFSDM control register1,                           Address offset: 0x100 */
  DFSDM1_Filter0->FLTCR2;     /*!< DFSDM control register2,                           Address offset: 0x104 */
  DFSDM1_Filter0->FLTISR;     /*!< DFSDM interrupt and status register,               Address offset: 0x108 */
  DFSDM1_Filter0->FLTICR;     /*!< DFSDM interrupt flag clear register,               Address offset: 0x10C */
  DFSDM1_Filter0->FLTJCHGR;   /*!< DFSDM injected channel group selection register,   Address offset: 0x110 */
  DFSDM1_Filter0->FLTFCR;     /*!< DFSDM filter control register,                     Address offset: 0x114 */
  DFSDM1_Filter0->FLTJDATAR;  /*!< DFSDM data register for injected group,            Address offset: 0x118 */
  DFSDM1_Filter0->FLTRDATAR;  /*!< DFSDM data register for regular group,             Address offset: 0x11C */
  DFSDM1_Filter0->FLTAWHTR;   /*!< DFSDM analog watchdog high threshold register,     Address offset: 0x120 */
  DFSDM1_Filter0->FLTAWLTR;   /*!< DFSDM analog watchdog low threshold register,      Address offset: 0x124 */
  DFSDM1_Filter0->FLTAWSR;    /*!< DFSDM analog watchdog status register              Address offset: 0x128 */
  DFSDM1_Filter0->FLTAWCFR;   /*!< DFSDM analog watchdog clear flag register          Address offset: 0x12C */
  DFSDM1_Filter0->FLTEXMAX;   /*!< DFSDM extreme detector maximum register,           Address offset: 0x130 */
  DFSDM1_Filter0->FLTEXMIN;   /*!< DFSDM extreme detector minimum register            Address offset: 0x134 */
  DFSDM1_Filter0->FLTCNVTIMR; /*!< DFSDM conversion timer,                            Address offset: 0x138 */
  // DFSDM_Filter_TypeDef;

  /**
   * @brief DFSDM channel configuration registers
   */

  DFSDM1_Channel0->CHCFGR1;  /*!< DFSDM channel configuration register1,                               Address offset: 0x00 */
  DFSDM1_Channel0->CHCFGR2;  /*!< DFSDM channel configuration register2,                               Address offset: 0x04 */
  DFSDM1_Channel0->CHAWSCDR; /*!< DFSDM channel analog watchdog and short circuit detector register,   Address offset: 0x08 */
  DFSDM1_Channel0->CHWDATAR; /*!< DFSDM channel watchdog filter data register,                         Address offset: 0x0C */
  DFSDM1_Channel0->CHDATINR; /*!< DFSDM channel data input register,                                   Address offset: 0x10 */
  // DFSDM_Channel_TypeDef;

  DFSDM1_Channel1->CHCFGR1;  /*!< DFSDM channel configuration register1,                               Address offset: 0x00 */
  DFSDM1_Channel1->CHCFGR2;  /*!< DFSDM channel configuration register2,                               Address offset: 0x04 */
  DFSDM1_Channel1->CHAWSCDR; /*!< DFSDM channel analog watchdog and short circuit detector register,   Address offset: 0x08 */
  DFSDM1_Channel1->CHWDATAR; /*!< DFSDM channel watchdog filter data register,                         Address offset: 0x0C */
  DFSDM1_Channel1->CHDATINR; /*!< DFSDM channel data input register,                                   Address offset: 0x10 */
  // DFSDM_Channel_TypeDef;

  DFSDM1_Channel2->CHCFGR1;  /*!< DFSDM channel configuration register1,                               Address offset: 0x00 */
  DFSDM1_Channel2->CHCFGR2;  /*!< DFSDM channel configuration register2,                               Address offset: 0x04 */
  DFSDM1_Channel2->CHAWSCDR; /*!< DFSDM channel analog watchdog and short circuit detector register,   Address offset: 0x08 */
  DFSDM1_Channel2->CHWDATAR; /*!< DFSDM channel watchdog filter data register,                         Address offset: 0x0C */
  DFSDM1_Channel2->CHDATINR; /*!< DFSDM channel data input register,                                   Address offset: 0x10 */
  // DFSDM_Channel_TypeDef;

