ExcessiveOverkill/drive-software-dev/stm32f413xx_Reg_Init.c
  DFSDM1_Channel3->CHCFGR1;  /*!< DFSDM channel configuration register1,                               Address offset: 0x00 */
  DFSDM1_Channel3->CHCFGR2;  /*!< DFSDM channel configuration register2,                               Address offset: 0x04 */
  DFSDM1_Channel3->CHAWSCDR; /*!< DFSDM channel analog watchdog and short circuit detector register,   Address offset: 0x08 */
  DFSDM1_Channel3->CHWDATAR; /*!< DFSDM channel watchdog filter data register,                         Address offset: 0x0C */
  DFSDM1_Channel3->CHDATINR; /*!< DFSDM channel data input register,                                   Address offset: 0x10 */
  // DFSDM_Channel_TypeDef;

  DFSDM2_Channel0->CHCFGR1;  /*!< DFSDM channel configuration register1,                               Address offset: 0x00 */
  DFSDM2_Channel0->CHCFGR2;  /*!< DFSDM channel configuration register2,                               Address offset: 0x04 */
  DFSDM2_Channel0->CHAWSCDR; /*!< DFSDM channel analog watchdog and short circuit detector register,   Address offset: 0x08 */
  DFSDM2_Channel0->CHWDATAR; /*!< DFSDM channel watchdog filter data register,                         Address offset: 0x0C */
  DFSDM2_Channel0->CHDATINR; /*!< DFSDM channel data input register,                                   Address offset: 0x10 */
  // DFSDM_Channel_TypeDef;

  DFSDM2_Channel1->CHCFGR1;  /*!< DFSDM channel configuration register1,                               Address offset: 0x00 */
  DFSDM2_Channel1->CHCFGR2;  /*!< DFSDM channel configuration register2,                               Address offset: 0x04 */
  DFSDM2_Channel1->CHAWSCDR; /*!< DFSDM channel analog watchdog and short circuit detector register,   Address offset: 0x08 */
  DFSDM2_Channel1->CHWDATAR; /*!< DFSDM channel watchdog filter data register,                         Address offset: 0x0C */
  DFSDM2_Channel1->CHDATINR; /*!< DFSDM channel data input register,                                   Address offset: 0x10 */
  // DFSDM_Channel_TypeDef;

  DFSDM2_Channel2->CHCFGR1;  /*!< DFSDM channel configuration register1,                               Address offset: 0x00 */
  DFSDM2_Channel2->CHCFGR2;  /*!< DFSDM channel configuration register2,                               Address offset: 0x04 */
  DFSDM2_Channel2->CHAWSCDR; /*!< DFSDM channel analog watchdog and short circuit detector register,   Address offset: 0x08 */
  DFSDM2_Channel2->CHWDATAR; /*!< DFSDM channel watchdog filter data register,                         Address offset: 0x0C */
  DFSDM2_Channel2->CHDATINR; /*!< DFSDM channel data input register,                                   Address offset: 0x10 */
  // DFSDM_Channel_TypeDef;

  DFSDM2_Channel3->CHCFGR1;  /*!< DFSDM channel configuration register1,                               Address offset: 0x00 */
  DFSDM2_Channel3->CHCFGR2;  /*!< DFSDM channel configuration register2,                               Address offset: 0x04 */
  DFSDM2_Channel3->CHAWSCDR; /*!< DFSDM channel analog watchdog and short circuit detector register,   Address offset: 0x08 */
  DFSDM2_Channel3->CHWDATAR; /*!< DFSDM channel watchdog filter data register,                         Address offset: 0x0C */
  DFSDM2_Channel3->CHDATINR; /*!< DFSDM channel data input register,                                   Address offset: 0x10 */
  // DFSDM_Channel_TypeDef;

  DFSDM2_Channel4->CHCFGR1;  /*!< DFSDM channel configuration register1,                               Address offset: 0x00 */
  DFSDM2_Channel4->CHCFGR2;  /*!< DFSDM channel configuration register2,                               Address offset: 0x04 */
  DFSDM2_Channel4->CHAWSCDR; /*!< DFSDM channel analog watchdog and short circuit detector register,   Address offset: 0x08 */
  DFSDM2_Channel4->CHWDATAR; /*!< DFSDM channel watchdog filter data register,                         Address offset: 0x0C */
  DFSDM2_Channel4->CHDATINR; /*!< DFSDM channel data input register,                                   Address offset: 0x10 */
  // DFSDM_Channel_TypeDef;

  DFSDM2_Channel5->CHCFGR1;  /*!< DFSDM channel configuration register1,                               Address offset: 0x00 */
  DFSDM2_Channel5->CHCFGR2;  /*!< DFSDM channel configuration register2,                               Address offset: 0x04 */
  DFSDM2_Channel5->CHAWSCDR; /*!< DFSDM channel analog watchdog and short circuit detector register,   Address offset: 0x08 */
  DFSDM2_Channel5->CHWDATAR; /*!< DFSDM channel watchdog filter data register,                         Address offset: 0x0C */
  DFSDM2_Channel5->CHDATINR; /*!< DFSDM channel data input register,                                   Address offset: 0x10 */
  // DFSDM_Channel_TypeDef;

  DFSDM2_Channel6->CHCFGR1;  /*!< DFSDM channel configuration register1,                               Address offset: 0x00 */
  DFSDM2_Channel6->CHCFGR2;  /*!< DFSDM channel configuration register2,                               Address offset: 0x04 */
  DFSDM2_Channel6->CHAWSCDR; /*!< DFSDM channel analog watchdog and short circuit detector register,   Address offset: 0x08 */
  DFSDM2_Channel6->CHWDATAR; /*!< DFSDM channel watchdog filter data register,                         Address offset: 0x0C */
  DFSDM2_Channel6->CHDATINR; /*!< DFSDM channel data input register,                                   Address offset: 0x10 */
  // DFSDM_Channel_TypeDef;

  DFSDM2_Channel7->CHCFGR1;  /*!< DFSDM channel configuration register1,                               Address offset: 0x00 */
  DFSDM2_Channel7->CHCFGR2;  /*!< DFSDM channel configuration register2,                               Address offset: 0x04 */
  DFSDM2_Channel7->CHAWSCDR; /*!< DFSDM channel analog watchdog and short circuit detector register,   Address offset: 0x08 */
  DFSDM2_Channel7->CHWDATAR; /*!< DFSDM channel watchdog filter data register,                         Address offset: 0x0C */
  DFSDM2_Channel7->CHDATINR; /*!< DFSDM channel data input register,                                   Address offset: 0x10 */
  // DFSDM_Channel_TypeDef;

  /**
   * @brief Digital to Analog Converter
   */

