ExcessiveOverkill/drive-software-dev/stm32f413xx_Reg_Init.c
  DAC1->CR;      /*!< DAC control register,                                    Address offset: 0x00 */
  DAC1->SWTRIGR; /*!< DAC software trigger register,                           Address offset: 0x04 */
  DAC1->DHR12R1; /*!< DAC channel1 12-bit right-aligned data holding register, Address offset: 0x08 */
  DAC1->DHR12L1; /*!< DAC channel1 12-bit left aligned data holding register,  Address offset: 0x0C */
  DAC1->DHR8R1;  /*!< DAC channel1 8-bit right aligned data holding register,  Address offset: 0x10 */
  DAC1->DHR12R2; /*!< DAC channel2 12-bit right aligned data holding register, Address offset: 0x14 */
  DAC1->DHR12L2; /*!< DAC channel2 12-bit left aligned data holding register,  Address offset: 0x18 */
  DAC1->DHR8R2;  /*!< DAC channel2 8-bit right-aligned data holding register,  Address offset: 0x1C */
  DAC1->DHR12RD; /*!< Dual DAC 12-bit right-aligned data holding register,     Address offset: 0x20 */
  DAC1->DHR12LD; /*!< DUAL DAC 12-bit left aligned data holding register,      Address offset: 0x24 */
  DAC1->DHR8RD;  /*!< DUAL DAC 8-bit right aligned data holding register,      Address offset: 0x28 */
  DAC1->DOR1;    /*!< DAC channel1 data output register,                       Address offset: 0x2C */
  DAC1->DOR2;    /*!< DAC channel2 data output register,                       Address offset: 0x30 */
  DAC1->SR;      /*!< DAC status register,                                     Address offset: 0x34 */
  // DAC_TypeDef;

  /**
   * @brief Debug MCU
   */

  DBGMCU->IDCODE; /*!< MCU device ID code,               Address offset: 0x00 */
  DBGMCU->CR;     /*!< Debug MCU configuration register, Address offset: 0x04 */
  DBGMCU->APB1FZ; /*!< Debug MCU APB1 freeze register,   Address offset: 0x08 */
  DBGMCU->APB2FZ; /*!< Debug MCU APB2 freeze register,   Address offset: 0x0C */
  // DBGMCU_TypeDef;

  /**
   * @brief DMA Controller
   */

  DMA1_Stream0->CR;   /*!< DMA stream x configuration register      */
  DMA1_Stream0->NDTR; /*!< DMA stream x number of data register     */
  DMA1_Stream0->PAR;  /*!< DMA stream x peripheral address register */
  DMA1_Stream0->M0AR; /*!< DMA stream x memory 0 address register   */
  DMA1_Stream0->M1AR; /*!< DMA stream x memory 1 address register   */
  DMA1_Stream0->FCR;  /*!< DMA stream x FIFO control register       */
  // DMA_Stream_TypeDef;

  DMA1_Stream1->CR;   /*!< DMA stream x configuration register      */
  DMA1_Stream1->NDTR; /*!< DMA stream x number of data register     */
  DMA1_Stream1->PAR;  /*!< DMA stream x peripheral address register */
  DMA1_Stream1->M0AR; /*!< DMA stream x memory 0 address register   */
  DMA1_Stream1->M1AR; /*!< DMA stream x memory 1 address register   */
  DMA1_Stream1->FCR;  /*!< DMA stream x FIFO control register       */
  // DMA_Stream_TypeDef;

  DMA1_Stream2->CR;   /*!< DMA stream x configuration register      */
  DMA1_Stream2->NDTR; /*!< DMA stream x number of data register     */
  DMA1_Stream2->PAR;  /*!< DMA stream x peripheral address register */
  DMA1_Stream2->M0AR; /*!< DMA stream x memory 0 address register   */
  DMA1_Stream2->M1AR; /*!< DMA stream x memory 1 address register   */
  DMA1_Stream2->FCR;  /*!< DMA stream x FIFO control register       */
  // DMA_Stream_TypeDef;

  DMA1_Stream3->CR;   /*!< DMA stream x configuration register      */
  DMA1_Stream3->NDTR; /*!< DMA stream x number of data register     */
  DMA1_Stream3->PAR;  /*!< DMA stream x peripheral address register */
  DMA1_Stream3->M0AR; /*!< DMA stream x memory 0 address register   */
  DMA1_Stream3->M1AR; /*!< DMA stream x memory 1 address register   */
  DMA1_Stream3->FCR;  /*!< DMA stream x FIFO control register       */
  // DMA_Stream_TypeDef;

  DMA1_Stream4->CR;   /*!< DMA stream x configuration register      */
  DMA1_Stream4->NDTR; /*!< DMA stream x number of data register     */
  DMA1_Stream4->PAR;  /*!< DMA stream x peripheral address register */
  DMA1_Stream4->M0AR; /*!< DMA stream x memory 0 address register   */
  DMA1_Stream4->M1AR; /*!< DMA stream x memory 1 address register   */
  DMA1_Stream4->FCR;  /*!< DMA stream x FIFO control register       */
  // DMA_Stream_TypeDef;

  DMA1_Stream5->CR;   /*!< DMA stream x configuration register      */
  DMA1_Stream5->NDTR; /*!< DMA stream x number of data register     */
  DMA1_Stream5->PAR;  /*!< DMA stream x peripheral address register */
  DMA1_Stream5->M0AR; /*!< DMA stream x memory 0 address register   */
  DMA1_Stream5->M1AR; /*!< DMA stream x memory 1 address register   */
  DMA1_Stream5->FCR;  /*!< DMA stream x FIFO control register       */
  // DMA_Stream_TypeDef;

  DMA1_Stream6->CR;   /*!< DMA stream x configuration register      */
  DMA1_Stream6->NDTR; /*!< DMA stream x number of data register     */
  DMA1_Stream6->PAR;  /*!< DMA stream x peripheral address register */
  DMA1_Stream6->M0AR; /*!< DMA stream x memory 0 address register   */
  DMA1_Stream6->M1AR; /*!< DMA stream x memory 1 address register   */
  DMA1_Stream6->FCR;  /*!< DMA stream x FIFO control register       */
  // DMA_Stream_TypeDef;

  DMA1_Stream7->CR;   /*!< DMA stream x configuration register      */
  DMA1_Stream7->NDTR; /*!< DMA stream x number of data register     */
  DMA1_Stream7->PAR;  /*!< DMA stream x peripheral address register */
  DMA1_Stream7->M0AR; /*!< DMA stream x memory 0 address register   */
  DMA1_Stream7->M1AR; /*!< DMA stream x memory 1 address register   */
  DMA1_Stream7->FCR;  /*!< DMA stream x FIFO control register       */
  // DMA_Stream_TypeDef;

  DMA2_Stream0->CR;   /*!< DMA stream x configuration register      */
  DMA2_Stream0->NDTR; /*!< DMA stream x number of data register     */
  DMA2_Stream0->PAR;  /*!< DMA stream x peripheral address register */
  DMA2_Stream0->M0AR; /*!< DMA stream x memory 0 address register   */
  DMA2_Stream0->M1AR; /*!< DMA stream x memory 1 address register   */
  DMA2_Stream0->FCR;  /*!< DMA stream x FIFO control register       */
  // DMA_Stream_TypeDef;

  DMA2_Stream1->CR;   /*!< DMA stream x configuration register      */
  DMA2_Stream1->NDTR; /*!< DMA stream x number of data register     */
  DMA2_Stream1->PAR;  /*!< DMA stream x peripheral address register */
  DMA2_Stream1->M0AR; /*!< DMA stream x memory 0 address register   */
  DMA2_Stream1->M1AR; /*!< DMA stream x memory 1 address register   */
  DMA2_Stream1->FCR;  /*!< DMA stream x FIFO control register       */
  // DMA_Stream_TypeDef;

