ExcessiveOverkill/drive-software-dev/stm32f413xx_Reg_Init.c
  DMA2_Stream2->CR;   /*!< DMA stream x configuration register      */
  DMA2_Stream2->NDTR; /*!< DMA stream x number of data register     */
  DMA2_Stream2->PAR;  /*!< DMA stream x peripheral address register */
  DMA2_Stream2->M0AR; /*!< DMA stream x memory 0 address register   */
  DMA2_Stream2->M1AR; /*!< DMA stream x memory 1 address register   */
  DMA2_Stream2->FCR;  /*!< DMA stream x FIFO control register       */
  // DMA_Stream_TypeDef;

  DMA2_Stream3->CR;   /*!< DMA stream x configuration register      */
  DMA2_Stream3->NDTR; /*!< DMA stream x number of data register     */
  DMA2_Stream3->PAR;  /*!< DMA stream x peripheral address register */
  DMA2_Stream3->M0AR; /*!< DMA stream x memory 0 address register   */
  DMA2_Stream3->M1AR; /*!< DMA stream x memory 1 address register   */
  DMA2_Stream3->FCR;  /*!< DMA stream x FIFO control register       */
  // DMA_Stream_TypeDef;

  DMA2_Stream4->CR;   /*!< DMA stream x configuration register      */
  DMA2_Stream4->NDTR; /*!< DMA stream x number of data register     */
  DMA2_Stream4->PAR;  /*!< DMA stream x peripheral address register */
  DMA2_Stream4->M0AR; /*!< DMA stream x memory 0 address register   */
  DMA2_Stream4->M1AR; /*!< DMA stream x memory 1 address register   */
  DMA2_Stream4->FCR;  /*!< DMA stream x FIFO control register       */
  // DMA_Stream_TypeDef;

  DMA2_Stream5->CR;   /*!< DMA stream x configuration register      */
  DMA2_Stream5->NDTR; /*!< DMA stream x number of data register     */
  DMA2_Stream5->PAR;  /*!< DMA stream x peripheral address register */
  DMA2_Stream5->M0AR; /*!< DMA stream x memory 0 address register   */
  DMA2_Stream5->M1AR; /*!< DMA stream x memory 1 address register   */
  DMA2_Stream5->FCR;  /*!< DMA stream x FIFO control register       */
  // DMA_Stream_TypeDef;

  DMA2_Stream6->CR;   /*!< DMA stream x configuration register      */
  DMA2_Stream6->NDTR; /*!< DMA stream x number of data register     */
  DMA2_Stream6->PAR;  /*!< DMA stream x peripheral address register */
  DMA2_Stream6->M0AR; /*!< DMA stream x memory 0 address register   */
  DMA2_Stream6->M1AR; /*!< DMA stream x memory 1 address register   */
  DMA2_Stream6->FCR;  /*!< DMA stream x FIFO control register       */
  // DMA_Stream_TypeDef;

  DMA2_Stream7->CR;   /*!< DMA stream x configuration register      */
  DMA2_Stream7->NDTR; /*!< DMA stream x number of data register     */
  DMA2_Stream7->PAR;  /*!< DMA stream x peripheral address register */
  DMA2_Stream7->M0AR; /*!< DMA stream x memory 0 address register   */
  DMA2_Stream7->M1AR; /*!< DMA stream x memory 1 address register   */
  DMA2_Stream7->FCR;  /*!< DMA stream x FIFO control register       */
  // DMA_Stream_TypeDef;

  DMA1->LISR;  /*!< DMA low interrupt status register,      Address offset: 0x00 */
  DMA1->HISR;  /*!< DMA high interrupt status register,     Address offset: 0x04 */
  DMA1->LIFCR; /*!< DMA low interrupt flag clear register,  Address offset: 0x08 */
  DMA1->HIFCR; /*!< DMA high interrupt flag clear register, Address offset: 0x0C */
  // DMA_TypeDef;

  DMA2->LISR;  /*!< DMA low interrupt status register,      Address offset: 0x00 */
  DMA2->HISR;  /*!< DMA high interrupt status register,     Address offset: 0x04 */
  DMA2->LIFCR; /*!< DMA low interrupt flag clear register,  Address offset: 0x08 */
  DMA2->HIFCR; /*!< DMA high interrupt flag clear register, Address offset: 0x0C */
  // DMA_TypeDef;

  /**
   * @brief External Interrupt/Event Controller
   */

  EXTI->IMR;   /*!< EXTI Interrupt mask register,            Address offset: 0x00 */
  EXTI->EMR;   /*!< EXTI Event mask register,                Address offset: 0x04 */
  EXTI->RTSR;  /*!< EXTI Rising trigger selection register,  Address offset: 0x08 */
  EXTI->FTSR;  /*!< EXTI Falling trigger selection register, Address offset: 0x0C */
  EXTI->SWIER; /*!< EXTI Software interrupt event register,  Address offset: 0x10 */
  EXTI->PR;    /*!< EXTI Pending register,                   Address offset: 0x14 */
  // EXTI_TypeDef;

  /**
   * @brief FLASH Registers
   */

  FLASH->ACR;     /*!< FLASH access control register,   Address offset: 0x00 */
  FLASH->KEYR;    /*!< FLASH key register,              Address offset: 0x04 */
  FLASH->OPTKEYR; /*!< FLASH option key register,       Address offset: 0x08 */
  FLASH->SR;      /*!< FLASH status register,           Address offset: 0x0C */
  FLASH->CR;      /*!< FLASH control register,          Address offset: 0x10 */
  FLASH->OPTCR;   /*!< FLASH option control register ,  Address offset: 0x14 */
  FLASH->OPTCR1;  /*!< FLASH option control register 1, Address offset: 0x18 */
  // FLASH_TypeDef;

  /**
   * @brief Flexible Static Memory Controller
   */

  FSMC_Bank1->BTCR[0]; /*!< NOR/PSRAM chip-select ctrl reg(BCR) and chip-select timing reg(BTR), Address offset: 0x00 */
  FSMC_Bank1->BTCR[1]; /*!< NOR/PSRAM chip-select ctrl reg(BCR) and chip-select timing reg(BTR), Address offset: 0x04 */
  FSMC_Bank1->BTCR[2]; /*!< NOR/PSRAM chip-select ctrl reg(BCR) and chip-select timing reg(BTR), Address offset: 0x08 */
  FSMC_Bank1->BTCR[3]; /*!< NOR/PSRAM chip-select ctrl reg(BCR) and chip-select timing reg(BTR), Address offset: 0x0C */
  FSMC_Bank1->BTCR[4]; /*!< NOR/PSRAM chip-select ctrl reg(BCR) and chip-select timing reg(BTR), Address offset: 0x10 */
  FSMC_Bank1->BTCR[5]; /*!< NOR/PSRAM chip-select ctrl reg(BCR) and chip-select timing reg(BTR), Address offset: 0x14 */
  FSMC_Bank1->BTCR[6]; /*!< NOR/PSRAM chip-select ctrl reg(BCR) and chip-select timing reg(BTR), Address offset: 0x18 */
  FSMC_Bank1->BTCR[7]; /*!< NOR/PSRAM chip-select ctrl reg(BCR) and chip-select timing reg(BTR), Address offset: 0x1C */
  // FSMC_Bank1_TypeDef;

  /**
   * @brief Flexible Static Memory Controller Bank1E
   */

  FSMC_Bank1E->BWTR[0]; /*!< NOR/PSRAM write timing registers, Address offset: 0x104 */
  FSMC_Bank1E->BWTR[1]; /*!< NOR/PSRAM write timing registers, Address offset: 0x108 */
  FSMC_Bank1E->BWTR[2]; /*!< NOR/PSRAM write timing registers, Address offset: 0x10C */
  FSMC_Bank1E->BWTR[3]; /*!< NOR/PSRAM write timing registers, Address offset: 0x110 */
  FSMC_Bank1E->BWTR[4]; /*!< NOR/PSRAM write timing registers, Address offset: 0x114 */
  FSMC_Bank1E->BWTR[5]; /*!< NOR/PSRAM write timing registers, Address offset: 0x118 */
  FSMC_Bank1E->BWTR[6]; /*!< NOR/PSRAM write timing registers, Address offset: 0x11C */
  // FSMC_Bank1E_TypeDef;
  /**
   * @brief General Purpose I/O
   */

  GPIOA->MODER = 0x0000;   /*!< GPIO port mode register,               Address offset: 0x00 */
  GPIOA->OTYPER = 0x0000;  /*!< GPIO port output type register,        Address offset: 0x04 */
  GPIOA->OSPEEDR = 0x0000; /*!< GPIO port output speed register,       Address offset: 0x08 */
  GPIOA->PUPDR = 0x0000;   /*!< GPIO port pull-up/pull-down register,  Address offset: 0x0C */
  GPIOA->IDR = 0x0000;     /*!< GPIO port input data register,         Address offset: 0x10 */
  GPIOA->ODR = 0x0000;     /*!< GPIO port output data register,        Address offset: 0x14 */
  GPIOA->BSRR = 0x0000;    /*!< GPIO port bit set/reset register,      Address offset: 0x18 */
  GPIOA->LCKR = 0x0000;    /*!< GPIO port configuration lock register, Address offset: 0x1C */
  GPIOA->AFR[0] = 0x0000;  /*!< GPIO alternate function registers,     Address offset: 0x20 */
  GPIOA->AFR[1] = 0x0000;  /*!< GPIO alternate function registers,     Address offset: 0x24 */
  // GPIO_TypeDef;

  GPIOB->MODER = 0x0000;   /*!< GPIO port mode register,               Address offset: 0x00 */
  GPIOB->OTYPER = 0x0000;  /*!< GPIO port output type register,        Address offset: 0x04 */
  GPIOB->OSPEEDR = 0x0000; /*!< GPIO port output speed register,       Address offset: 0x08 */
  GPIOB->PUPDR = 0x0000;   /*!< GPIO port pull-up/pull-down register,  Address offset: 0x0C */
  GPIOB->IDR = 0x0000;     /*!< GPIO port input data register,         Address offset: 0x10 */
  GPIOB->ODR = 0x0000;     /*!< GPIO port output data register,        Address offset: 0x14 */
  GPIOB->BSRR = 0x0000;    /*!< GPIO port bit set/reset register,      Address offset: 0x18 */
  GPIOB->LCKR = 0x0000;    /*!< GPIO port configuration lock register, Address offset: 0x1C */
  GPIOB->AFR[0] = 0x0000;  /*!< GPIO alternate function registers,     Address offset: 0x20 */
  GPIOB->AFR[1] = 0x0000;  /*!< GPIO alternate function registers,     Address offset: 0x24 */
  // GPIO_TypeDef;

