ExcessiveOverkill/drive-software-dev/stm32f413xx_Reg_Init.c
  GPIOC->MODER = 0x0000;   /*!< GPIO port mode register,               Address offset: 0x00 */
  GPIOC->OTYPER = 0x0000;  /*!< GPIO port output type register,        Address offset: 0x04 */
  GPIOC->OSPEEDR = 0x0000; /*!< GPIO port output speed register,       Address offset: 0x08 */
  GPIOC->PUPDR = 0x0000;   /*!< GPIO port pull-up/pull-down register,  Address offset: 0x0C */
  GPIOC->IDR = 0x0000;     /*!< GPIO port input data register,         Address offset: 0x10 */
  GPIOC->ODR = 0x0000;     /*!< GPIO port output data register,        Address offset: 0x14 */
  GPIOC->BSRR = 0x0000;    /*!< GPIO port bit set/reset register,      Address offset: 0x18 */
  GPIOC->LCKR = 0x0000;    /*!< GPIO port configuration lock register, Address offset: 0x1C */
  GPIOC->AFR[0] = 0x0000;  /*!< GPIO alternate function registers,     Address offset: 0x20 */
  GPIOC->AFR[1] = 0x0000;  /*!< GPIO alternate function registers,     Address offset: 0x24 */
  // GPIO_TypeDef;

  GPIOD->MODER = 0x0000;   /*!< GPIO port mode register,               Address offset: 0x00 */
  GPIOD->OTYPER = 0x0000;  /*!< GPIO port output type register,        Address offset: 0x04 */
  GPIOD->OSPEEDR = 0x0000; /*!< GPIO port output speed register,       Address offset: 0x08 */
  GPIOD->PUPDR = 0x0000;   /*!< GPIO port pull-up/pull-down register,  Address offset: 0x0C */
  GPIOD->IDR = 0x0000;     /*!< GPIO port input data register,         Address offset: 0x10 */
  GPIOD->ODR = 0x0000;     /*!< GPIO port output data register,        Address offset: 0x14 */
  GPIOD->BSRR = 0x0000;    /*!< GPIO port bit set/reset register,      Address offset: 0x18 */
  GPIOD->LCKR = 0x0000;    /*!< GPIO port configuration lock register, Address offset: 0x1C */
  GPIOD->AFR[0] = 0x0000;  /*!< GPIO alternate function registers,     Address offset: 0x20 */
  GPIOD->AFR[1] = 0x0000;  /*!< GPIO alternate function registers,     Address offset: 0x24 */
  // GPIO_TypeDef;

  GPIOE->MODER = 0x0000;   /*!< GPIO port mode register,               Address offset: 0x00 */
  GPIOE->OTYPER = 0x0000;  /*!< GPIO port output type register,        Address offset: 0x04 */
  GPIOE->OSPEEDR = 0x0000; /*!< GPIO port output speed register,       Address offset: 0x08 */
  GPIOE->PUPDR = 0x0000;   /*!< GPIO port pull-up/pull-down register,  Address offset: 0x0C */
  GPIOE->IDR = 0x0000;     /*!< GPIO port input data register,         Address offset: 0x10 */
  GPIOE->ODR = 0x0000;     /*!< GPIO port output data register,        Address offset: 0x14 */
  GPIOE->BSRR = 0x0000;    /*!< GPIO port bit set/reset register,      Address offset: 0x18 */
  GPIOE->LCKR = 0x0000;    /*!< GPIO port configuration lock register, Address offset: 0x1C */
  GPIOE->AFR[0] = 0x0000;  /*!< GPIO alternate function registers,     Address offset: 0x20 */
  GPIOE->AFR[1] = 0x0000;  /*!< GPIO alternate function registers,     Address offset: 0x24 */
  // GPIO_TypeDef;

  GPIOF->MODER = 0x0000;   /*!< GPIO port mode register,               Address offset: 0x00 */
  GPIOF->OTYPER = 0x0000;  /*!< GPIO port output type register,        Address offset: 0x04 */
  GPIOF->OSPEEDR = 0x0000; /*!< GPIO port output speed register,       Address offset: 0x08 */
  GPIOF->PUPDR = 0x0000;   /*!< GPIO port pull-up/pull-down register,  Address offset: 0x0C */
  GPIOF->IDR = 0x0000;     /*!< GPIO port input data register,         Address offset: 0x10 */
  GPIOF->ODR = 0x0000;     /*!< GPIO port output data register,        Address offset: 0x14 */
  GPIOF->BSRR = 0x0000;    /*!< GPIO port bit set/reset register,      Address offset: 0x18 */
  GPIOF->LCKR = 0x0000;    /*!< GPIO port configuration lock register, Address offset: 0x1C */
  GPIOF->AFR[0] = 0x0000;  /*!< GPIO alternate function registers,     Address offset: 0x20 */
  GPIOF->AFR[1] = 0x0000;  /*!< GPIO alternate function registers,     Address offset: 0x24 */
  // GPIO_TypeDef;

  GPIOG->MODER = 0x0000;   /*!< GPIO port mode register,               Address offset: 0x00 */
  GPIOG->OTYPER = 0x0000;  /*!< GPIO port output type register,        Address offset: 0x04 */
  GPIOG->OSPEEDR = 0x0000; /*!< GPIO port output speed register,       Address offset: 0x08 */
  GPIOG->PUPDR = 0x0000;   /*!< GPIO port pull-up/pull-down register,  Address offset: 0x0C */
  GPIOG->IDR = 0x0000;     /*!< GPIO port input data register,         Address offset: 0x10 */
  GPIOG->ODR = 0x0000;     /*!< GPIO port output data register,        Address offset: 0x14 */
  GPIOG->BSRR = 0x0000;    /*!< GPIO port bit set/reset register,      Address offset: 0x18 */
  GPIOG->LCKR = 0x0000;    /*!< GPIO port configuration lock register, Address offset: 0x1C */
  GPIOG->AFR[0] = 0x0000;  /*!< GPIO alternate function registers,     Address offset: 0x20 */
  GPIOG->AFR[1] = 0x0000;  /*!< GPIO alternate function registers,     Address offset: 0x24 */
  // GPIO_TypeDef;

  GPIOH->MODER = 0x0000;   /*!< GPIO port mode register,               Address offset: 0x00 */
  GPIOH->OTYPER = 0x0000;  /*!< GPIO port output type register,        Address offset: 0x04 */
  GPIOH->OSPEEDR = 0x0000; /*!< GPIO port output speed register,       Address offset: 0x08 */
  GPIOH->PUPDR = 0x0000;   /*!< GPIO port pull-up/pull-down register,  Address offset: 0x0C */
  GPIOH->IDR = 0x0000;     /*!< GPIO port input data register,         Address offset: 0x10 */
  GPIOH->ODR = 0x0000;     /*!< GPIO port output data register,        Address offset: 0x14 */
  GPIOH->BSRR = 0x0000;    /*!< GPIO port bit set/reset register,      Address offset: 0x18 */
  GPIOH->LCKR = 0x0000;    /*!< GPIO port configuration lock register, Address offset: 0x1C */
  GPIOH->AFR[0] = 0x0000;  /*!< GPIO alternate function registers,     Address offset: 0x20 */
  GPIOH->AFR[1] = 0x0000;  /*!< GPIO alternate function registers,     Address offset: 0x24 */
  // GPIO_TypeDef;

  /**
   * @brief System configuration controller
   */

  SYSCFG->MEMRMP;    /*!< SYSCFG memory remap register,                      Address offset: 0x00 */
  SYSCFG->PMC;       /*!< SYSCFG peripheral mode configuration register,     Address offset: 0x04 */
  SYSCFG->EXTICR[0]; /*!< SYSCFG external interrupt configuration registers, Address offset: 0x08 */
  SYSCFG->EXTICR[1]; /*!< SYSCFG external interrupt configuration registers, Address offset: 0x0C */
  SYSCFG->EXTICR[2]; /*!< SYSCFG external interrupt configuration registers, Address offset: 0x10 */
  SYSCFG->EXTICR[3]; /*!< SYSCFG external interrupt configuration registers, Address offset: 0x14 */
  SYSCFG->CFGR2;     /*!< SYSCFG Configuration register2,                    Address offset: 0x1C */
  SYSCFG->CMPCR;     /*!< SYSCFG Compensation cell control register,         Address offset: 0x20 */
  SYSCFG->CFGR;      /*!< SYSCFG Configuration register,                     Address offset: 0x2C */
  SYSCFG->MCHDLYCR;  /*!< SYSCFG multi-channel delay register,               Address offset: 0x30 */
  // SYSCFG_TypeDef;

  /**
   * @brief Inter-integrated Circuit Interface
   */

  I2C1->CR1;   /*!< I2C Control register 1,     Address offset: 0x00 */
  I2C1->CR2;   /*!< I2C Control register 2,     Address offset: 0x04 */
  I2C1->OAR1;  /*!< I2C Own address register 1, Address offset: 0x08 */
  I2C1->OAR2;  /*!< I2C Own address register 2, Address offset: 0x0C */
  I2C1->DR;    /*!< I2C Data register,          Address offset: 0x10 */
  I2C1->SR1;   /*!< I2C Status register 1,      Address offset: 0x14 */
  I2C1->SR2;   /*!< I2C Status register 2,      Address offset: 0x18 */
  I2C1->CCR;   /*!< I2C Clock control register, Address offset: 0x1C */
  I2C1->TRISE; /*!< I2C TRISE register,         Address offset: 0x20 */
  I2C1->FLTR;  /*!< I2C FLTR register,          Address offset: 0x24 */
  // I2C_TypeDef;

