ExcessiveOverkill/drive-software-dev/stm32f413xx_Reg_Init.c
  I2C2->CR1;   /*!< I2C Control register 1,     Address offset: 0x00 */
  I2C2->CR2;   /*!< I2C Control register 2,     Address offset: 0x04 */
  I2C2->OAR1;  /*!< I2C Own address register 1, Address offset: 0x08 */
  I2C2->OAR2;  /*!< I2C Own address register 2, Address offset: 0x0C */
  I2C2->DR;    /*!< I2C Data register,          Address offset: 0x10 */
  I2C2->SR1;   /*!< I2C Status register 1,      Address offset: 0x14 */
  I2C2->SR2;   /*!< I2C Status register 2,      Address offset: 0x18 */
  I2C2->CCR;   /*!< I2C Clock control register, Address offset: 0x1C */
  I2C2->TRISE; /*!< I2C TRISE register,         Address offset: 0x20 */
  I2C2->FLTR;  /*!< I2C FLTR register,          Address offset: 0x24 */
  // I2C_TypeDef;

  I2C3->CR1;   /*!< I2C Control register 1,     Address offset: 0x00 */
  I2C3->CR2;   /*!< I2C Control register 2,     Address offset: 0x04 */
  I2C3->OAR1;  /*!< I2C Own address register 1, Address offset: 0x08 */
  I2C3->OAR2;  /*!< I2C Own address register 2, Address offset: 0x0C */
  I2C3->DR;    /*!< I2C Data register,          Address offset: 0x10 */
  I2C3->SR1;   /*!< I2C Status register 1,      Address offset: 0x14 */
  I2C3->SR2;   /*!< I2C Status register 2,      Address offset: 0x18 */
  I2C3->CCR;   /*!< I2C Clock control register, Address offset: 0x1C */
  I2C3->TRISE; /*!< I2C TRISE register,         Address offset: 0x20 */
  I2C3->FLTR;  /*!< I2C FLTR register,          Address offset: 0x24 */
  // I2C_TypeDef;

  /**
   * @brief Inter-integrated Circuit Interface
   */

  FMPI2C1->CR1;      /*!< FMPI2C Control register 1,            Address offset: 0x00 */
  FMPI2C1->CR2;      /*!< FMPI2C Control register 2,            Address offset: 0x04 */
  FMPI2C1->OAR1;     /*!< FMPI2C Own address 1 register,        Address offset: 0x08 */
  FMPI2C1->OAR2;     /*!< FMPI2C Own address 2 register,        Address offset: 0x0C */
  FMPI2C1->TIMINGR;  /*!< FMPI2C Timing register,               Address offset: 0x10 */
  FMPI2C1->TIMEOUTR; /*!< FMPI2C Timeout register,              Address offset: 0x14 */
  FMPI2C1->ISR;      /*!< FMPI2C Interrupt and status register, Address offset: 0x18 */
  FMPI2C1->ICR;      /*!< FMPI2C Interrupt clear register,      Address offset: 0x1C */
  FMPI2C1->PECR;     /*!< FMPI2C PEC register,                  Address offset: 0x20 */
  FMPI2C1->RXDR;     /*!< FMPI2C Receive data register,         Address offset: 0x24 */
  FMPI2C1->TXDR;     /*!< FMPI2C Transmit data register,        Address offset: 0x28 */
  // FMPI2C_TypeDef;

  /**
   * @brief Independent WATCHDOG
   */

  IWDG->KR;  /*!< IWDG Key register,       Address offset: 0x00 */
  IWDG->PR;  /*!< IWDG Prescaler register, Address offset: 0x04 */
  IWDG->RLR; /*!< IWDG Reload register,    Address offset: 0x08 */
  IWDG->SR;  /*!< IWDG Status register,    Address offset: 0x0C */
  // IWDG_TypeDef;

  /**
   * @brief Power Control
   */

  PWR->CR;  /*!< PWR power control register,        Address offset: 0x00 */
  PWR->CSR; /*!< PWR power control/status register, Address offset: 0x04 */
  // PWR_TypeDef;

  /**
   * @brief Reset and Clock Control
   */

  RCC->CR;         /*!< RCC clock control register,                                  Address offset: 0x00 */
  RCC->PLLCFGR;    /*!< RCC PLL configuration register,                              Address offset: 0x04 */
  RCC->CFGR;       /*!< RCC clock configuration register,                            Address offset: 0x08 */
  RCC->CIR;        /*!< RCC clock interrupt register,                                Address offset: 0x0C */
  RCC->AHB1RSTR;   /*!< RCC AHB1 peripheral reset register,                          Address offset: 0x10 */
  RCC->AHB2RSTR;   /*!< RCC AHB2 peripheral reset register,                          Address offset: 0x14 */
  RCC->AHB3RSTR;   /*!< RCC AHB3 peripheral reset register,                          Address offset: 0x18 */
  RCC->APB1RSTR;   /*!< RCC APB1 peripheral reset register,                          Address offset: 0x20 */
  RCC->APB2RSTR;   /*!< RCC APB2 peripheral reset register,                          Address offset: 0x24 */
  RCC->AHB1ENR;    /*!< RCC AHB1 peripheral clock register,                          Address offset: 0x30 */
  RCC->AHB2ENR;    /*!< RCC AHB2 peripheral clock register,                          Address offset: 0x34 */
  RCC->AHB3ENR;    /*!< RCC AHB3 peripheral clock register,                          Address offset: 0x38 */
  RCC->APB1ENR;    /*!< RCC APB1 peripheral clock enable register,                   Address offset: 0x40 */
  RCC->APB2ENR;    /*!< RCC APB2 peripheral clock enable register,                   Address offset: 0x44 */
  RCC->AHB1LPENR;  /*!< RCC AHB1 peripheral clock enable in low power mode register, Address offset: 0x50 */
  RCC->AHB2LPENR;  /*!< RCC AHB2 peripheral clock enable in low power mode register, Address offset: 0x54 */
  RCC->AHB3LPENR;  /*!< RCC AHB3 peripheral clock enable in low power mode register, Address offset: 0x58 */
  RCC->APB1LPENR;  /*!< RCC APB1 peripheral clock enable in low power mode register, Address offset: 0x60 */
  RCC->APB2LPENR;  /*!< RCC APB2 peripheral clock enable in low power mode register, Address offset: 0x64 */
  RCC->BDCR;       /*!< RCC Backup domain control register,                          Address offset: 0x70 */
  RCC->CSR;        /*!< RCC clock control & status register,                         Address offset: 0x74 */
  RCC->SSCGR;      /*!< RCC spread spectrum clock generation register,               Address offset: 0x80 */
  RCC->PLLI2SCFGR; /*!< RCC PLLI2S configuration register,                           Address offset: 0x84 */
  RCC->DCKCFGR;    /*!< RCC Dedicated Clocks configuration register,                 Address offset: 0x8C */
  RCC->CKGATENR;   /*!< RCC Clocks Gated ENable Register,                            Address offset: 0x90 */
  RCC->DCKCFGR2;   /*!< RCC Dedicated Clocks configuration register 2,               Address offset: 0x94 */
  // RCC_TypeDef;

  /**
   * @brief Real-Time Clock
   */

  RTC->TR;       /*!< RTC time register,                                        Address offset: 0x00 */
  RTC->DR;       /*!< RTC date register,                                        Address offset: 0x04 */
  RTC->CR;       /*!< RTC control register,                                     Address offset: 0x08 */
  RTC->ISR;      /*!< RTC initialization and status register,                   Address offset: 0x0C */
  RTC->PRER;     /*!< RTC prescaler register,                                   Address offset: 0x10 */
  RTC->WUTR;     /*!< RTC wakeup timer register,                                Address offset: 0x14 */
  RTC->CALIBR;   /*!< RTC calibration register,                                 Address offset: 0x18 */
  RTC->ALRMAR;   /*!< RTC alarm A register,                                     Address offset: 0x1C */
  RTC->ALRMBR;   /*!< RTC alarm B register,                                     Address offset: 0x20 */
  RTC->WPR;      /*!< RTC write protection register,                            Address offset: 0x24 */
  RTC->SSR;      /*!< RTC sub second register,                                  Address offset: 0x28 */
  RTC->SHIFTR;   /*!< RTC shift control register,                               Address offset: 0x2C */
  RTC->TSTR;     /*!< RTC time stamp time register,                             Address offset: 0x30 */
  RTC->TSDR;     /*!< RTC time stamp date register,                             Address offset: 0x34 */
  RTC->TSSSR;    /*!< RTC time-stamp sub second register,                       Address offset: 0x38 */
  RTC->CALR;     /*!< RTC calibration register,                                 Address offset: 0x3C */
  RTC->TAFCR;    /*!< RTC tamper and alternate function configuration register, Address offset: 0x40 */
  RTC->ALRMASSR; /*!< RTC alarm A sub second register,                          Address offset: 0x44 */
  RTC->ALRMBSSR; /*!< RTC alarm B sub second register,                          Address offset: 0x48 */
  RTC->BKP0R;    /*!< RTC backup register 1,                                    Address offset: 0x50 */
  RTC->BKP1R;    /*!< RTC backup register 1,                                    Address offset: 0x54 */
  RTC->BKP2R;    /*!< RTC backup register 2,                                    Address offset: 0x58 */
  RTC->BKP3R;    /*!< RTC backup register 3,                                    Address offset: 0x5C */
  RTC->BKP4R;    /*!< RTC backup register 4,                                    Address offset: 0x60 */
  RTC->BKP5R;    /*!< RTC backup register 5,                                    Address offset: 0x64 */
  RTC->BKP6R;    /*!< RTC backup register 6,                                    Address offset: 0x68 */
  RTC->BKP7R;    /*!< RTC backup register 7,                                    Address offset: 0x6C */
  RTC->BKP8R;    /*!< RTC backup register 8,                                    Address offset: 0x70 */
  RTC->BKP9R;    /*!< RTC backup register 9,                                    Address offset: 0x74 */
  RTC->BKP10R;   /*!< RTC backup register 10,                                   Address offset: 0x78 */
  RTC->BKP11R;   /*!< RTC backup register 11,                                   Address offset: 0x7C */
  RTC->BKP12R;   /*!< RTC backup register 12,                                   Address offset: 0x80 */
  RTC->BKP13R;   /*!< RTC backup register 13,                                   Address offset: 0x84 */
  RTC->BKP14R;   /*!< RTC backup register 14,                                   Address offset: 0x88 */
  RTC->BKP15R;   /*!< RTC backup register 15,                                   Address offset: 0x8C */
  RTC->BKP16R;   /*!< RTC backup register 16,                                   Address offset: 0x90 */
  RTC->BKP17R;   /*!< RTC backup register 17,                                   Address offset: 0x94 */
  RTC->BKP18R;   /*!< RTC backup register 18,                                   Address offset: 0x98 */
  RTC->BKP19R;   /*!< RTC backup register 19,                                   Address offset: 0x9C */
  // RTC_TypeDef;

  /**
   * @brief Serial Audio Interface
   */

  SAI1->GCR; /*!< SAI global configuration register,        Address offset: 0x00 */
  // SAI_TypeDef;

  SAI1_Block_A->CR1;   /*!< SAI block x configuration register 1,     Address offset: 0x04 */
  SAI1_Block_A->CR2;   /*!< SAI block x configuration register 2,     Address offset: 0x08 */
  SAI1_Block_A->FRCR;  /*!< SAI block x frame configuration register, Address offset: 0x0C */
  SAI1_Block_A->SLOTR; /*!< SAI block x slot register,                Address offset: 0x10 */
  SAI1_Block_A->IMR;   /*!< SAI block x interrupt mask register,      Address offset: 0x14 */
  SAI1_Block_A->SR;    /*!< SAI block x status register,              Address offset: 0x18 */
  SAI1_Block_A->CLRFR; /*!< SAI block x clear flag register,          Address offset: 0x1C */
  SAI1_Block_A->DR;    /*!< SAI block x data register,                Address offset: 0x20 */
  // SAI_Block_TypeDef;

