ExcessiveOverkill/drive-software-dev/stm32f413xx_Reg_Init.c
  SAI1_Block_B->CR1;   /*!< SAI block x configuration register 1,     Address offset: 0x04 */
  SAI1_Block_B->CR2;   /*!< SAI block x configuration register 2,     Address offset: 0x08 */
  SAI1_Block_B->FRCR;  /*!< SAI block x frame configuration register, Address offset: 0x0C */
  SAI1_Block_B->SLOTR; /*!< SAI block x slot register,                Address offset: 0x10 */
  SAI1_Block_B->IMR;   /*!< SAI block x interrupt mask register,      Address offset: 0x14 */
  SAI1_Block_B->SR;    /*!< SAI block x status register,              Address offset: 0x18 */
  SAI1_Block_B->CLRFR; /*!< SAI block x clear flag register,          Address offset: 0x1C */
  SAI1_Block_B->DR;    /*!< SAI block x data register,                Address offset: 0x20 */
  // SAI_Block_TypeDef;

  /**
   * @brief SD host Interface
   */

  SDIO->POWER;   /*!< SDIO power control register,    Address offset: 0x00 */
  SDIO->CLKCR;   /*!< SDI clock control register,     Address offset: 0x04 */
  SDIO->ARG;     /*!< SDIO argument register,         Address offset: 0x08 */
  SDIO->CMD;     /*!< SDIO command register,          Address offset: 0x0C */
  SDIO->RESPCMD; /*!< SDIO command response register, Address offset: 0x10 */
  SDIO->RESP1;   /*!< SDIO response 1 register,       Address offset: 0x14 */
  SDIO->RESP2;   /*!< SDIO response 2 register,       Address offset: 0x18 */
  SDIO->RESP3;   /*!< SDIO response 3 register,       Address offset: 0x1C */
  SDIO->RESP4;   /*!< SDIO response 4 register,       Address offset: 0x20 */
  SDIO->DTIMER;  /*!< SDIO data timer register,       Address offset: 0x24 */
  SDIO->DLEN;    /*!< SDIO data length register,      Address offset: 0x28 */
  SDIO->DCTRL;   /*!< SDIO data control register,     Address offset: 0x2C */
  SDIO->DCOUNT;  /*!< SDIO data counter register,     Address offset: 0x30 */
  SDIO->STA;     /*!< SDIO status register,           Address offset: 0x34 */
  SDIO->ICR;     /*!< SDIO interrupt clear register,  Address offset: 0x38 */
  SDIO->MASK;    /*!< SDIO mask register,             Address offset: 0x3C */
  SDIO->FIFOCNT; /*!< SDIO FIFO counter register,     Address offset: 0x48 */
  SDIO->FIFO;    /*!< SDIO data FIFO register,        Address offset: 0x80 */
  // SDIO_TypeDef;

  /**
   * @brief Serial Peripheral Interface
   */

  SPI1->CR1;     /*!< SPI control register 1 (not used in I2S mode),      Address offset: 0x00 */
  SPI1->CR2;     /*!< SPI control register 2,                             Address offset: 0x04 */
  SPI1->SR;      /*!< SPI status register,                                Address offset: 0x08 */
  SPI1->DR;      /*!< SPI data register,                                  Address offset: 0x0C */
  SPI1->CRCPR;   /*!< SPI CRC polynomial register (not used in I2S mode), Address offset: 0x10 */
  SPI1->RXCRCR;  /*!< SPI RX CRC register (not used in I2S mode),         Address offset: 0x14 */
  SPI1->TXCRCR;  /*!< SPI TX CRC register (not used in I2S mode),         Address offset: 0x18 */
  SPI1->I2SCFGR; /*!< SPI_I2S configuration register,                     Address offset: 0x1C */
  SPI1->I2SPR;   /*!< SPI_I2S prescaler register,                         Address offset: 0x20 */
  // SPI_TypeDef;

  SPI2->CR1;     /*!< SPI control register 1 (not used in I2S mode),      Address offset: 0x00 */
  SPI2->CR2;     /*!< SPI control register 2,                             Address offset: 0x04 */
  SPI2->SR;      /*!< SPI status register,                                Address offset: 0x08 */
  SPI2->DR;      /*!< SPI data register,                                  Address offset: 0x0C */
  SPI2->CRCPR;   /*!< SPI CRC polynomial register (not used in I2S mode), Address offset: 0x10 */
  SPI2->RXCRCR;  /*!< SPI RX CRC register (not used in I2S mode),         Address offset: 0x14 */
  SPI2->TXCRCR;  /*!< SPI TX CRC register (not used in I2S mode),         Address offset: 0x18 */
  SPI2->I2SCFGR; /*!< SPI_I2S configuration register,                     Address offset: 0x1C */
  SPI2->I2SPR;   /*!< SPI_I2S prescaler register,                         Address offset: 0x20 */
  // SPI_TypeDef;

  SPI3->CR1;     /*!< SPI control register 1 (not used in I2S mode),      Address offset: 0x00 */
  SPI3->CR2;     /*!< SPI control register 2,                             Address offset: 0x04 */
  SPI3->SR;      /*!< SPI status register,                                Address offset: 0x08 */
  SPI3->DR;      /*!< SPI data register,                                  Address offset: 0x0C */
  SPI3->CRCPR;   /*!< SPI CRC polynomial register (not used in I2S mode), Address offset: 0x10 */
  SPI3->RXCRCR;  /*!< SPI RX CRC register (not used in I2S mode),         Address offset: 0x14 */
  SPI3->TXCRCR;  /*!< SPI TX CRC register (not used in I2S mode),         Address offset: 0x18 */
  SPI3->I2SCFGR; /*!< SPI_I2S configuration register,                     Address offset: 0x1C */
  SPI3->I2SPR;   /*!< SPI_I2S prescaler register,                         Address offset: 0x20 */
  // SPI_TypeDef;

  SPI4->CR1;     /*!< SPI control register 1 (not used in I2S mode),      Address offset: 0x00 */
  SPI4->CR2;     /*!< SPI control register 2,                             Address offset: 0x04 */
  SPI4->SR;      /*!< SPI status register,                                Address offset: 0x08 */
  SPI4->DR;      /*!< SPI data register,                                  Address offset: 0x0C */
  SPI4->CRCPR;   /*!< SPI CRC polynomial register (not used in I2S mode), Address offset: 0x10 */
  SPI4->RXCRCR;  /*!< SPI RX CRC register (not used in I2S mode),         Address offset: 0x14 */
  SPI4->TXCRCR;  /*!< SPI TX CRC register (not used in I2S mode),         Address offset: 0x18 */
  SPI4->I2SCFGR; /*!< SPI_I2S configuration register,                     Address offset: 0x1C */
  SPI4->I2SPR;   /*!< SPI_I2S prescaler register,                         Address offset: 0x20 */
  // SPI_TypeDef;

  SPI5->CR1;     /*!< SPI control register 1 (not used in I2S mode),      Address offset: 0x00 */
  SPI5->CR2;     /*!< SPI control register 2,                             Address offset: 0x04 */
  SPI5->SR;      /*!< SPI status register,                                Address offset: 0x08 */
  SPI5->DR;      /*!< SPI data register,                                  Address offset: 0x0C */
  SPI5->CRCPR;   /*!< SPI CRC polynomial register (not used in I2S mode), Address offset: 0x10 */
  SPI5->RXCRCR;  /*!< SPI RX CRC register (not used in I2S mode),         Address offset: 0x14 */
  SPI5->TXCRCR;  /*!< SPI TX CRC register (not used in I2S mode),         Address offset: 0x18 */
  SPI5->I2SCFGR; /*!< SPI_I2S configuration register,                     Address offset: 0x1C */
  SPI5->I2SPR;   /*!< SPI_I2S prescaler register,                         Address offset: 0x20 */
  // SPI_TypeDef;

  I2S2ext->CR1;     /*!< SPI control register 1 (not used in I2S mode),      Address offset: 0x00 */
  I2S2ext->CR2;     /*!< SPI control register 2,                             Address offset: 0x04 */
  I2S2ext->SR;      /*!< SPI status register,                                Address offset: 0x08 */
  I2S2ext->DR;      /*!< SPI data register,                                  Address offset: 0x0C */
  I2S2ext->CRCPR;   /*!< SPI CRC polynomial register (not used in I2S mode), Address offset: 0x10 */
  I2S2ext->RXCRCR;  /*!< SPI RX CRC register (not used in I2S mode),         Address offset: 0x14 */
  I2S2ext->TXCRCR;  /*!< SPI TX CRC register (not used in I2S mode),         Address offset: 0x18 */
  I2S2ext->I2SCFGR; /*!< SPI_I2S configuration register,                     Address offset: 0x1C */
  I2S2ext->I2SPR;   /*!< SPI_I2S prescaler register,                         Address offset: 0x20 */
  // SPI_TypeDef;

  I2S3ext->CR1;     /*!< SPI control register 1 (not used in I2S mode),      Address offset: 0x00 */
  I2S3ext->CR2;     /*!< SPI control register 2,                             Address offset: 0x04 */
  I2S3ext->SR;      /*!< SPI status register,                                Address offset: 0x08 */
  I2S3ext->DR;      /*!< SPI data register,                                  Address offset: 0x0C */
  I2S3ext->CRCPR;   /*!< SPI CRC polynomial register (not used in I2S mode), Address offset: 0x10 */
  I2S3ext->RXCRCR;  /*!< SPI RX CRC register (not used in I2S mode),         Address offset: 0x14 */
  I2S3ext->TXCRCR;  /*!< SPI TX CRC register (not used in I2S mode),         Address offset: 0x18 */
  I2S3ext->I2SCFGR; /*!< SPI_I2S configuration register,                     Address offset: 0x1C */
  I2S3ext->I2SPR;   /*!< SPI_I2S prescaler register,                         Address offset: 0x20 */
  // SPI_TypeDef;

  /**
   * @brief QUAD Serial Peripheral Interface
   */

  QUADSPI->CR;    /*!< QUADSPI Control register,                           Address offset: 0x00 */
  QUADSPI->DCR;   /*!< QUADSPI Device Configuration register,              Address offset: 0x04 */
  QUADSPI->SR;    /*!< QUADSPI Status register,                            Address offset: 0x08 */
  QUADSPI->FCR;   /*!< QUADSPI Flag Clear register,                        Address offset: 0x0C */
  QUADSPI->DLR;   /*!< QUADSPI Data Length register,                       Address offset: 0x10 */
  QUADSPI->CCR;   /*!< QUADSPI Communication Configuration register,       Address offset: 0x14 */
  QUADSPI->AR;    /*!< QUADSPI Address register,                           Address offset: 0x18 */
  QUADSPI->ABR;   /*!< QUADSPI Alternate Bytes register,                   Address offset: 0x1C */
  QUADSPI->DR;    /*!< QUADSPI Data register,                              Address offset: 0x20 */
  QUADSPI->PSMKR; /*!< QUADSPI Polling Status Mask register,               Address offset: 0x24 */
  QUADSPI->PSMAR; /*!< QUADSPI Polling Status Match register,              Address offset: 0x28 */
  QUADSPI->PIR;   /*!< QUADSPI Polling Interval register,                  Address offset: 0x2C */
  QUADSPI->LPTR;  /*!< QUADSPI Low Power Timeout register,                 Address offset: 0x30 */
  // QUADSPI_TypeDef;

  /**
   * @brief TIM
   */

  TIM1->CR1;   /*!< TIM control register 1,              Address offset: 0x00 */
  TIM1->CR2;   /*!< TIM control register 2,              Address offset: 0x04 */
  TIM1->SMCR;  /*!< TIM slave mode control register,     Address offset: 0x08 */
  TIM1->DIER;  /*!< TIM DMA/interrupt enable register,   Address offset: 0x0C */
  TIM1->SR;    /*!< TIM status register,                 Address offset: 0x10 */
  TIM1->EGR;   /*!< TIM event generation register,       Address offset: 0x14 */
  TIM1->CCMR1; /*!< TIM capture/compare mode register 1, Address offset: 0x18 */
  TIM1->CCMR2; /*!< TIM capture/compare mode register 2, Address offset: 0x1C */
  TIM1->CCER;  /*!< TIM capture/compare enable register, Address offset: 0x20 */
  TIM1->CNT;   /*!< TIM counter register,                Address offset: 0x24 */
  TIM1->PSC;   /*!< TIM prescaler,                       Address offset: 0x28 */
  TIM1->ARR;   /*!< TIM auto-reload register,            Address offset: 0x2C */
  TIM1->RCR;   /*!< TIM repetition counter register,     Address offset: 0x30 */
  TIM1->CCR1;  /*!< TIM capture/compare register 1,      Address offset: 0x34 */
  TIM1->CCR2;  /*!< TIM capture/compare register 2,      Address offset: 0x38 */
  TIM1->CCR3;  /*!< TIM capture/compare register 3,      Address offset: 0x3C */
  TIM1->CCR4;  /*!< TIM capture/compare register 4,      Address offset: 0x40 */
  TIM1->BDTR;  /*!< TIM break and dead-time register,    Address offset: 0x44 */
  TIM1->DCR;   /*!< TIM DMA control register,            Address offset: 0x48 */
  TIM1->DMAR;  /*!< TIM DMA address for full transfer,   Address offset: 0x4C */
  TIM1->OR;    /*!< TIM option register,                 Address offset: 0x50 */
  // TIM_TypeDef;

  TIM2->CR1;   /*!< TIM control register 1,              Address offset: 0x00 */
  TIM2->CR2;   /*!< TIM control register 2,              Address offset: 0x04 */
  TIM2->SMCR;  /*!< TIM slave mode control register,     Address offset: 0x08 */
  TIM2->DIER;  /*!< TIM DMA/interrupt enable register,   Address offset: 0x0C */
  TIM2->SR;    /*!< TIM status register,                 Address offset: 0x10 */
  TIM2->EGR;   /*!< TIM event generation register,       Address offset: 0x14 */
  TIM2->CCMR1; /*!< TIM capture/compare mode register 1, Address offset: 0x18 */
  TIM2->CCMR2; /*!< TIM capture/compare mode register 2, Address offset: 0x1C */
  TIM2->CCER;  /*!< TIM capture/compare enable register, Address offset: 0x20 */
  TIM2->CNT;   /*!< TIM counter register,                Address offset: 0x24 */
  TIM2->PSC;   /*!< TIM prescaler,                       Address offset: 0x28 */
  TIM2->ARR;   /*!< TIM auto-reload register,            Address offset: 0x2C */
  TIM2->RCR;   /*!< TIM repetition counter register,     Address offset: 0x30 */
  TIM2->CCR1;  /*!< TIM capture/compare register 1,      Address offset: 0x34 */
  TIM2->CCR2;  /*!< TIM capture/compare register 2,      Address offset: 0x38 */
  TIM2->CCR3;  /*!< TIM capture/compare register 3,      Address offset: 0x3C */
  TIM2->CCR4;  /*!< TIM capture/compare register 4,      Address offset: 0x40 */
  TIM2->BDTR;  /*!< TIM break and dead-time register,    Address offset: 0x44 */
  TIM2->DCR;   /*!< TIM DMA control register,            Address offset: 0x48 */
  TIM2->DMAR;  /*!< TIM DMA address for full transfer,   Address offset: 0x4C */
  TIM2->OR;    /*!< TIM option register,                 Address offset: 0x50 */
  // TIM_TypeDef;

  TIM3->CR1;   /*!< TIM control register 1,              Address offset: 0x00 */
  TIM3->CR2;   /*!< TIM control register 2,              Address offset: 0x04 */
  TIM3->SMCR;  /*!< TIM slave mode control register,     Address offset: 0x08 */
  TIM3->DIER;  /*!< TIM DMA/interrupt enable register,   Address offset: 0x0C */
  TIM3->SR;    /*!< TIM status register,                 Address offset: 0x10 */
  TIM3->EGR;   /*!< TIM event generation register,       Address offset: 0x14 */
  TIM3->CCMR1; /*!< TIM capture/compare mode register 1, Address offset: 0x18 */
  TIM3->CCMR2; /*!< TIM capture/compare mode register 2, Address offset: 0x1C */
  TIM3->CCER;  /*!< TIM capture/compare enable register, Address offset: 0x20 */
  TIM3->CNT;   /*!< TIM counter register,                Address offset: 0x24 */
  TIM3->PSC;   /*!< TIM prescaler,                       Address offset: 0x28 */
  TIM3->ARR;   /*!< TIM auto-reload register,            Address offset: 0x2C */
  TIM3->RCR;   /*!< TIM repetition counter register,     Address offset: 0x30 */
  TIM3->CCR1;  /*!< TIM capture/compare register 1,      Address offset: 0x34 */
  TIM3->CCR2;  /*!< TIM capture/compare register 2,      Address offset: 0x38 */
  TIM3->CCR3;  /*!< TIM capture/compare register 3,      Address offset: 0x3C */
  TIM3->CCR4;  /*!< TIM capture/compare register 4,      Address offset: 0x40 */
  TIM3->BDTR;  /*!< TIM break and dead-time register,    Address offset: 0x44 */
  TIM3->DCR;   /*!< TIM DMA control register,            Address offset: 0x48 */
  TIM3->DMAR;  /*!< TIM DMA address for full transfer,   Address offset: 0x4C */
  TIM3->OR;    /*!< TIM option register,                 Address offset: 0x50 */
  // TIM_TypeDef;

  TIM4->CR1;   /*!< TIM control register 1,              Address offset: 0x00 */
  TIM4->CR2;   /*!< TIM control register 2,              Address offset: 0x04 */
  TIM4->SMCR;  /*!< TIM slave mode control register,     Address offset: 0x08 */
  TIM4->DIER;  /*!< TIM DMA/interrupt enable register,   Address offset: 0x0C */
  TIM4->SR;    /*!< TIM status register,                 Address offset: 0x10 */
  TIM4->EGR;   /*!< TIM event generation register,       Address offset: 0x14 */
  TIM4->CCMR1; /*!< TIM capture/compare mode register 1, Address offset: 0x18 */
  TIM4->CCMR2; /*!< TIM capture/compare mode register 2, Address offset: 0x1C */
  TIM4->CCER;  /*!< TIM capture/compare enable register, Address offset: 0x20 */
  TIM4->CNT;   /*!< TIM counter register,                Address offset: 0x24 */
  TIM4->PSC;   /*!< TIM prescaler,                       Address offset: 0x28 */
  TIM4->ARR;   /*!< TIM auto-reload register,            Address offset: 0x2C */
  TIM4->RCR;   /*!< TIM repetition counter register,     Address offset: 0x30 */
  TIM4->CCR1;  /*!< TIM capture/compare register 1,      Address offset: 0x34 */
  TIM4->CCR2;  /*!< TIM capture/compare register 2,      Address offset: 0x38 */
  TIM4->CCR3;  /*!< TIM capture/compare register 3,      Address offset: 0x3C */
  TIM4->CCR4;  /*!< TIM capture/compare register 4,      Address offset: 0x40 */
  TIM4->BDTR;  /*!< TIM break and dead-time register,    Address offset: 0x44 */
  TIM4->DCR;   /*!< TIM DMA control register,            Address offset: 0x48 */
  TIM4->DMAR;  /*!< TIM DMA address for full transfer,   Address offset: 0x4C */
  TIM4->OR;    /*!< TIM option register,                 Address offset: 0x50 */
  // TIM_TypeDef;

  TIM5->CR1;   /*!< TIM control register 1,              Address offset: 0x00 */
  TIM5->CR2;   /*!< TIM control register 2,              Address offset: 0x04 */
  TIM5->SMCR;  /*!< TIM slave mode control register,     Address offset: 0x08 */
  TIM5->DIER;  /*!< TIM DMA/interrupt enable register,   Address offset: 0x0C */
  TIM5->SR;    /*!< TIM status register,                 Address offset: 0x10 */
  TIM5->EGR;   /*!< TIM event generation register,       Address offset: 0x14 */
  TIM5->CCMR1; /*!< TIM capture/compare mode register 1, Address offset: 0x18 */
  TIM5->CCMR2; /*!< TIM capture/compare mode register 2, Address offset: 0x1C */
  TIM5->CCER;  /*!< TIM capture/compare enable register, Address offset: 0x20 */
  TIM5->CNT;   /*!< TIM counter register,                Address offset: 0x24 */
  TIM5->PSC;   /*!< TIM prescaler,                       Address offset: 0x28 */
  TIM5->ARR;   /*!< TIM auto-reload register,            Address offset: 0x2C */
  TIM5->RCR;   /*!< TIM repetition counter register,     Address offset: 0x30 */
  TIM5->CCR1;  /*!< TIM capture/compare register 1,      Address offset: 0x34 */
  TIM5->CCR2;  /*!< TIM capture/compare register 2,      Address offset: 0x38 */
  TIM5->CCR3;  /*!< TIM capture/compare register 3,      Address offset: 0x3C */
  TIM5->CCR4;  /*!< TIM capture/compare register 4,      Address offset: 0x40 */
  TIM5->BDTR;  /*!< TIM break and dead-time register,    Address offset: 0x44 */
  TIM5->DCR;   /*!< TIM DMA control register,            Address offset: 0x48 */
  TIM5->DMAR;  /*!< TIM DMA address for full transfer,   Address offset: 0x4C */
  TIM5->OR;    /*!< TIM option register,                 Address offset: 0x50 */
  // TIM_TypeDef;

  TIM6->CR1;   /*!< TIM control register 1,              Address offset: 0x00 */
  TIM6->CR2;   /*!< TIM control register 2,              Address offset: 0x04 */
  TIM6->SMCR;  /*!< TIM slave mode control register,     Address offset: 0x08 */
  TIM6->DIER;  /*!< TIM DMA/interrupt enable register,   Address offset: 0x0C */
  TIM6->SR;    /*!< TIM status register,                 Address offset: 0x10 */
  TIM6->EGR;   /*!< TIM event generation register,       Address offset: 0x14 */
  TIM6->CCMR1; /*!< TIM capture/compare mode register 1, Address offset: 0x18 */
  TIM6->CCMR2; /*!< TIM capture/compare mode register 2, Address offset: 0x1C */
  TIM6->CCER;  /*!< TIM capture/compare enable register, Address offset: 0x20 */
  TIM6->CNT;   /*!< TIM counter register,                Address offset: 0x24 */
  TIM6->PSC;   /*!< TIM prescaler,                       Address offset: 0x28 */
  TIM6->ARR;   /*!< TIM auto-reload register,            Address offset: 0x2C */
  TIM6->RCR;   /*!< TIM repetition counter register,     Address offset: 0x30 */
  TIM6->CCR1;  /*!< TIM capture/compare register 1,      Address offset: 0x34 */
  TIM6->CCR2;  /*!< TIM capture/compare register 2,      Address offset: 0x38 */
  TIM6->CCR3;  /*!< TIM capture/compare register 3,      Address offset: 0x3C */
  TIM6->CCR4;  /*!< TIM capture/compare register 4,      Address offset: 0x40 */
  TIM6->BDTR;  /*!< TIM break and dead-time register,    Address offset: 0x44 */
  TIM6->DCR;   /*!< TIM DMA control register,            Address offset: 0x48 */
  TIM6->DMAR;  /*!< TIM DMA address for full transfer,   Address offset: 0x4C */
  TIM6->OR;    /*!< TIM option register,                 Address offset: 0x50 */
  // TIM_TypeDef;

