ExcessiveOverkill/drive-software-dev/stm32f413xx_Reg_Init.c
  TIM7->CR1;   /*!< TIM control register 1,              Address offset: 0x00 */
  TIM7->CR2;   /*!< TIM control register 2,              Address offset: 0x04 */
  TIM7->SMCR;  /*!< TIM slave mode control register,     Address offset: 0x08 */
  TIM7->DIER;  /*!< TIM DMA/interrupt enable register,   Address offset: 0x0C */
  TIM7->SR;    /*!< TIM status register,                 Address offset: 0x10 */
  TIM7->EGR;   /*!< TIM event generation register,       Address offset: 0x14 */
  TIM7->CCMR1; /*!< TIM capture/compare mode register 1, Address offset: 0x18 */
  TIM7->CCMR2; /*!< TIM capture/compare mode register 2, Address offset: 0x1C */
  TIM7->CCER;  /*!< TIM capture/compare enable register, Address offset: 0x20 */
  TIM7->CNT;   /*!< TIM counter register,                Address offset: 0x24 */
  TIM7->PSC;   /*!< TIM prescaler,                       Address offset: 0x28 */
  TIM7->ARR;   /*!< TIM auto-reload register,            Address offset: 0x2C */
  TIM7->RCR;   /*!< TIM repetition counter register,     Address offset: 0x30 */
  TIM7->CCR1;  /*!< TIM capture/compare register 1,      Address offset: 0x34 */
  TIM7->CCR2;  /*!< TIM capture/compare register 2,      Address offset: 0x38 */
  TIM7->CCR3;  /*!< TIM capture/compare register 3,      Address offset: 0x3C */
  TIM7->CCR4;  /*!< TIM capture/compare register 4,      Address offset: 0x40 */
  TIM7->BDTR;  /*!< TIM break and dead-time register,    Address offset: 0x44 */
  TIM7->DCR;   /*!< TIM DMA control register,            Address offset: 0x48 */
  TIM7->DMAR;  /*!< TIM DMA address for full transfer,   Address offset: 0x4C */
  TIM7->OR;    /*!< TIM option register,                 Address offset: 0x50 */
  // TIM_TypeDef;

  TIM8->CR1;   /*!< TIM control register 1,              Address offset: 0x00 */
  TIM8->CR2;   /*!< TIM control register 2,              Address offset: 0x04 */
  TIM8->SMCR;  /*!< TIM slave mode control register,     Address offset: 0x08 */
  TIM8->DIER;  /*!< TIM DMA/interrupt enable register,   Address offset: 0x0C */
  TIM8->SR;    /*!< TIM status register,                 Address offset: 0x10 */
  TIM8->EGR;   /*!< TIM event generation register,       Address offset: 0x14 */
  TIM8->CCMR1; /*!< TIM capture/compare mode register 1, Address offset: 0x18 */
  TIM8->CCMR2; /*!< TIM capture/compare mode register 2, Address offset: 0x1C */
  TIM8->CCER;  /*!< TIM capture/compare enable register, Address offset: 0x20 */
  TIM8->CNT;   /*!< TIM counter register,                Address offset: 0x24 */
  TIM8->PSC;   /*!< TIM prescaler,                       Address offset: 0x28 */
  TIM8->ARR;   /*!< TIM auto-reload register,            Address offset: 0x2C */
  TIM8->RCR;   /*!< TIM repetition counter register,     Address offset: 0x30 */
  TIM8->CCR1;  /*!< TIM capture/compare register 1,      Address offset: 0x34 */
  TIM8->CCR2;  /*!< TIM capture/compare register 2,      Address offset: 0x38 */
  TIM8->CCR3;  /*!< TIM capture/compare register 3,      Address offset: 0x3C */
  TIM8->CCR4;  /*!< TIM capture/compare register 4,      Address offset: 0x40 */
  TIM8->BDTR;  /*!< TIM break and dead-time register,    Address offset: 0x44 */
  TIM8->DCR;   /*!< TIM DMA control register,            Address offset: 0x48 */
  TIM8->DMAR;  /*!< TIM DMA address for full transfer,   Address offset: 0x4C */
  TIM8->OR;    /*!< TIM option register,                 Address offset: 0x50 */
  // TIM_TypeDef;

  TIM9->CR1;   /*!< TIM control register 1,              Address offset: 0x00 */
  TIM9->CR2;   /*!< TIM control register 2,              Address offset: 0x04 */
  TIM9->SMCR;  /*!< TIM slave mode control register,     Address offset: 0x08 */
  TIM9->DIER;  /*!< TIM DMA/interrupt enable register,   Address offset: 0x0C */
  TIM9->SR;    /*!< TIM status register,                 Address offset: 0x10 */
  TIM9->EGR;   /*!< TIM event generation register,       Address offset: 0x14 */
  TIM9->CCMR1; /*!< TIM capture/compare mode register 1, Address offset: 0x18 */
  TIM9->CCMR2; /*!< TIM capture/compare mode register 2, Address offset: 0x1C */
  TIM9->CCER;  /*!< TIM capture/compare enable register, Address offset: 0x20 */
  TIM9->CNT;   /*!< TIM counter register,                Address offset: 0x24 */
  TIM9->PSC;   /*!< TIM prescaler,                       Address offset: 0x28 */
  TIM9->ARR;   /*!< TIM auto-reload register,            Address offset: 0x2C */
  TIM9->RCR;   /*!< TIM repetition counter register,     Address offset: 0x30 */
  TIM9->CCR1;  /*!< TIM capture/compare register 1,      Address offset: 0x34 */
  TIM9->CCR2;  /*!< TIM capture/compare register 2,      Address offset: 0x38 */
  TIM9->CCR3;  /*!< TIM capture/compare register 3,      Address offset: 0x3C */
  TIM9->CCR4;  /*!< TIM capture/compare register 4,      Address offset: 0x40 */
  TIM9->BDTR;  /*!< TIM break and dead-time register,    Address offset: 0x44 */
  TIM9->DCR;   /*!< TIM DMA control register,            Address offset: 0x48 */
  TIM9->DMAR;  /*!< TIM DMA address for full transfer,   Address offset: 0x4C */
  TIM9->OR;    /*!< TIM option register,                 Address offset: 0x50 */
  // TIM_TypeDef;

  TIM10->CR1;   /*!< TIM control register 1,              Address offset: 0x00 */
  TIM10->CR2;   /*!< TIM control register 2,              Address offset: 0x04 */
  TIM10->SMCR;  /*!< TIM slave mode control register,     Address offset: 0x08 */
  TIM10->DIER;  /*!< TIM DMA/interrupt enable register,   Address offset: 0x0C */
  TIM10->SR;    /*!< TIM status register,                 Address offset: 0x10 */
  TIM10->EGR;   /*!< TIM event generation register,       Address offset: 0x14 */
  TIM10->CCMR1; /*!< TIM capture/compare mode register 1, Address offset: 0x18 */
  TIM10->CCMR2; /*!< TIM capture/compare mode register 2, Address offset: 0x1C */
  TIM10->CCER;  /*!< TIM capture/compare enable register, Address offset: 0x20 */
  TIM10->CNT;   /*!< TIM counter register,                Address offset: 0x24 */
  TIM10->PSC;   /*!< TIM prescaler,                       Address offset: 0x28 */
  TIM10->ARR;   /*!< TIM auto-reload register,            Address offset: 0x2C */
  TIM10->RCR;   /*!< TIM repetition counter register,     Address offset: 0x30 */
  TIM10->CCR1;  /*!< TIM capture/compare register 1,      Address offset: 0x34 */
  TIM10->CCR2;  /*!< TIM capture/compare register 2,      Address offset: 0x38 */
  TIM10->CCR3;  /*!< TIM capture/compare register 3,      Address offset: 0x3C */
  TIM10->CCR4;  /*!< TIM capture/compare register 4,      Address offset: 0x40 */
  TIM10->BDTR;  /*!< TIM break and dead-time register,    Address offset: 0x44 */
  TIM10->DCR;   /*!< TIM DMA control register,            Address offset: 0x48 */
  TIM10->DMAR;  /*!< TIM DMA address for full transfer,   Address offset: 0x4C */
  TIM10->OR;    /*!< TIM option register,                 Address offset: 0x50 */
  // TIM_TypeDef;

  TIM11->CR1;   /*!< TIM control register 1,              Address offset: 0x00 */
  TIM11->CR2;   /*!< TIM control register 2,              Address offset: 0x04 */
  TIM11->SMCR;  /*!< TIM slave mode control register,     Address offset: 0x08 */
  TIM11->DIER;  /*!< TIM DMA/interrupt enable register,   Address offset: 0x0C */
  TIM11->SR;    /*!< TIM status register,                 Address offset: 0x10 */
  TIM11->EGR;   /*!< TIM event generation register,       Address offset: 0x14 */
  TIM11->CCMR1; /*!< TIM capture/compare mode register 1, Address offset: 0x18 */
  TIM11->CCMR2; /*!< TIM capture/compare mode register 2, Address offset: 0x1C */
  TIM11->CCER;  /*!< TIM capture/compare enable register, Address offset: 0x20 */
  TIM11->CNT;   /*!< TIM counter register,                Address offset: 0x24 */
  TIM11->PSC;   /*!< TIM prescaler,                       Address offset: 0x28 */
  TIM11->ARR;   /*!< TIM auto-reload register,            Address offset: 0x2C */
  TIM11->RCR;   /*!< TIM repetition counter register,     Address offset: 0x30 */
  TIM11->CCR1;  /*!< TIM capture/compare register 1,      Address offset: 0x34 */
  TIM11->CCR2;  /*!< TIM capture/compare register 2,      Address offset: 0x38 */
  TIM11->CCR3;  /*!< TIM capture/compare register 3,      Address offset: 0x3C */
  TIM11->CCR4;  /*!< TIM capture/compare register 4,      Address offset: 0x40 */
  TIM11->BDTR;  /*!< TIM break and dead-time register,    Address offset: 0x44 */
  TIM11->DCR;   /*!< TIM DMA control register,            Address offset: 0x48 */
  TIM11->DMAR;  /*!< TIM DMA address for full transfer,   Address offset: 0x4C */
  TIM11->OR;    /*!< TIM option register,                 Address offset: 0x50 */
  // TIM_TypeDef;

