ExcessiveOverkill/drive-software-dev/stm32f413xx_Reg_Init.c
  TIM12->CR1;   /*!< TIM control register 1,              Address offset: 0x00 */
  TIM12->CR2;   /*!< TIM control register 2,              Address offset: 0x04 */
  TIM12->SMCR;  /*!< TIM slave mode control register,     Address offset: 0x08 */
  TIM12->DIER;  /*!< TIM DMA/interrupt enable register,   Address offset: 0x0C */
  TIM12->SR;    /*!< TIM status register,                 Address offset: 0x10 */
  TIM12->EGR;   /*!< TIM event generation register,       Address offset: 0x14 */
  TIM12->CCMR1; /*!< TIM capture/compare mode register 1, Address offset: 0x18 */
  TIM12->CCMR2; /*!< TIM capture/compare mode register 2, Address offset: 0x1C */
  TIM12->CCER;  /*!< TIM capture/compare enable register, Address offset: 0x20 */
  TIM12->CNT;   /*!< TIM counter register,                Address offset: 0x24 */
  TIM12->PSC;   /*!< TIM prescaler,                       Address offset: 0x28 */
  TIM12->ARR;   /*!< TIM auto-reload register,            Address offset: 0x2C */
  TIM12->RCR;   /*!< TIM repetition counter register,     Address offset: 0x30 */
  TIM12->CCR1;  /*!< TIM capture/compare register 1,      Address offset: 0x34 */
  TIM12->CCR2;  /*!< TIM capture/compare register 2,      Address offset: 0x38 */
  TIM12->CCR3;  /*!< TIM capture/compare register 3,      Address offset: 0x3C */
  TIM12->CCR4;  /*!< TIM capture/compare register 4,      Address offset: 0x40 */
  TIM12->BDTR;  /*!< TIM break and dead-time register,    Address offset: 0x44 */
  TIM12->DCR;   /*!< TIM DMA control register,            Address offset: 0x48 */
  TIM12->DMAR;  /*!< TIM DMA address for full transfer,   Address offset: 0x4C */
  TIM12->OR;    /*!< TIM option register,                 Address offset: 0x50 */
  // TIM_TypeDef;

  TIM13->CR1;   /*!< TIM control register 1,              Address offset: 0x00 */
  TIM13->CR2;   /*!< TIM control register 2,              Address offset: 0x04 */
  TIM13->SMCR;  /*!< TIM slave mode control register,     Address offset: 0x08 */
  TIM13->DIER;  /*!< TIM DMA/interrupt enable register,   Address offset: 0x0C */
  TIM13->SR;    /*!< TIM status register,                 Address offset: 0x10 */
  TIM13->EGR;   /*!< TIM event generation register,       Address offset: 0x14 */
  TIM13->CCMR1; /*!< TIM capture/compare mode register 1, Address offset: 0x18 */
  TIM13->CCMR2; /*!< TIM capture/compare mode register 2, Address offset: 0x1C */
  TIM13->CCER;  /*!< TIM capture/compare enable register, Address offset: 0x20 */
  TIM13->CNT;   /*!< TIM counter register,                Address offset: 0x24 */
  TIM13->PSC;   /*!< TIM prescaler,                       Address offset: 0x28 */
  TIM13->ARR;   /*!< TIM auto-reload register,            Address offset: 0x2C */
  TIM13->RCR;   /*!< TIM repetition counter register,     Address offset: 0x30 */
  TIM13->CCR1;  /*!< TIM capture/compare register 1,      Address offset: 0x34 */
  TIM13->CCR2;  /*!< TIM capture/compare register 2,      Address offset: 0x38 */
  TIM13->CCR3;  /*!< TIM capture/compare register 3,      Address offset: 0x3C */
  TIM13->CCR4;  /*!< TIM capture/compare register 4,      Address offset: 0x40 */
  TIM13->BDTR;  /*!< TIM break and dead-time register,    Address offset: 0x44 */
  TIM13->DCR;   /*!< TIM DMA control register,            Address offset: 0x48 */
  TIM13->DMAR;  /*!< TIM DMA address for full transfer,   Address offset: 0x4C */
  TIM13->OR;    /*!< TIM option register,                 Address offset: 0x50 */
  // TIM_TypeDef;

  TIM14->CR1;   /*!< TIM control register 1,              Address offset: 0x00 */
  TIM14->CR2;   /*!< TIM control register 2,              Address offset: 0x04 */
  TIM14->SMCR;  /*!< TIM slave mode control register,     Address offset: 0x08 */
  TIM14->DIER;  /*!< TIM DMA/interrupt enable register,   Address offset: 0x0C */
  TIM14->SR;    /*!< TIM status register,                 Address offset: 0x10 */
  TIM14->EGR;   /*!< TIM event generation register,       Address offset: 0x14 */
  TIM14->CCMR1; /*!< TIM capture/compare mode register 1, Address offset: 0x18 */
  TIM14->CCMR2; /*!< TIM capture/compare mode register 2, Address offset: 0x1C */
  TIM14->CCER;  /*!< TIM capture/compare enable register, Address offset: 0x20 */
  TIM14->CNT;   /*!< TIM counter register,                Address offset: 0x24 */
  TIM14->PSC;   /*!< TIM prescaler,                       Address offset: 0x28 */
  TIM14->ARR;   /*!< TIM auto-reload register,            Address offset: 0x2C */
  TIM14->RCR;   /*!< TIM repetition counter register,     Address offset: 0x30 */
  TIM14->CCR1;  /*!< TIM capture/compare register 1,      Address offset: 0x34 */
  TIM14->CCR2;  /*!< TIM capture/compare register 2,      Address offset: 0x38 */
  TIM14->CCR3;  /*!< TIM capture/compare register 3,      Address offset: 0x3C */
  TIM14->CCR4;  /*!< TIM capture/compare register 4,      Address offset: 0x40 */
  TIM14->BDTR;  /*!< TIM break and dead-time register,    Address offset: 0x44 */
  TIM14->DCR;   /*!< TIM DMA control register,            Address offset: 0x48 */
  TIM14->DMAR;  /*!< TIM DMA address for full transfer,   Address offset: 0x4C */
  TIM14->OR;    /*!< TIM option register,                 Address offset: 0x50 */
  // TIM_TypeDef;

  /**
   * @brief Universal Synchronous Asynchronous Receiver Transmitter
   */

  USART2->SR;   /*!< USART Status register,                   Address offset: 0x00 */
  USART2->DR;   /*!< USART Data register,                     Address offset: 0x04 */
  USART2->BRR;  /*!< USART Baud rate register,                Address offset: 0x08 */
  USART2->CR1;  /*!< USART Control register 1,                Address offset: 0x0C */
  USART2->CR2;  /*!< USART Control register 2,                Address offset: 0x10 */
  USART2->CR3;  /*!< USART Control register 3,                Address offset: 0x14 */
  USART2->GTPR; /*!< USART Guard time and prescaler register, Address offset: 0x18 */
  // USART_TypeDef;

  USART3->SR;   /*!< USART Status register,                   Address offset: 0x00 */
  USART3->DR;   /*!< USART Data register,                     Address offset: 0x04 */
  USART3->BRR;  /*!< USART Baud rate register,                Address offset: 0x08 */
  USART3->CR1;  /*!< USART Control register 1,                Address offset: 0x0C */
  USART3->CR2;  /*!< USART Control register 2,                Address offset: 0x10 */
  USART3->CR3;  /*!< USART Control register 3,                Address offset: 0x14 */
  USART3->GTPR; /*!< USART Guard time and prescaler register, Address offset: 0x18 */
  // USART_TypeDef;

