ExcessiveOverkill/drive-software-dev/stm32f413xx_Reg_Init.c
  UART4->SR;   /*!< USART Status register,                   Address offset: 0x00 */
  UART4->DR;   /*!< USART Data register,                     Address offset: 0x04 */
  UART4->BRR;  /*!< USART Baud rate register,                Address offset: 0x08 */
  UART4->CR1;  /*!< USART Control register 1,                Address offset: 0x0C */
  UART4->CR2;  /*!< USART Control register 2,                Address offset: 0x10 */
  UART4->CR3;  /*!< USART Control register 3,                Address offset: 0x14 */
  UART4->GTPR; /*!< USART Guard time and prescaler register, Address offset: 0x18 */
  // USART_TypeDef;

  UART5->SR;   /*!< USART Status register,                   Address offset: 0x00 */
  UART5->DR;   /*!< USART Data register,                     Address offset: 0x04 */
  UART5->BRR;  /*!< USART Baud rate register,                Address offset: 0x08 */
  UART5->CR1;  /*!< USART Control register 1,                Address offset: 0x0C */
  UART5->CR2;  /*!< USART Control register 2,                Address offset: 0x10 */
  UART5->CR3;  /*!< USART Control register 3,                Address offset: 0x14 */
  UART5->GTPR; /*!< USART Guard time and prescaler register, Address offset: 0x18 */
  // USART_TypeDef;

  UART7->SR;   /*!< USART Status register,                   Address offset: 0x00 */
  UART7->DR;   /*!< USART Data register,                     Address offset: 0x04 */
  UART7->BRR;  /*!< USART Baud rate register,                Address offset: 0x08 */
  UART7->CR1;  /*!< USART Control register 1,                Address offset: 0x0C */
  UART7->CR2;  /*!< USART Control register 2,                Address offset: 0x10 */
  UART7->CR3;  /*!< USART Control register 3,                Address offset: 0x14 */
  UART7->GTPR; /*!< USART Guard time and prescaler register, Address offset: 0x18 */
  // USART_TypeDef;

  UART8->SR;   /*!< USART Status register,                   Address offset: 0x00 */
  UART8->DR;   /*!< USART Data register,                     Address offset: 0x04 */
  UART8->BRR;  /*!< USART Baud rate register,                Address offset: 0x08 */
  UART8->CR1;  /*!< USART Control register 1,                Address offset: 0x0C */
  UART8->CR2;  /*!< USART Control register 2,                Address offset: 0x10 */
  UART8->CR3;  /*!< USART Control register 3,                Address offset: 0x14 */
  UART8->GTPR; /*!< USART Guard time and prescaler register, Address offset: 0x18 */
  // USART_TypeDef;

  USART1->SR;   /*!< USART Status register,                   Address offset: 0x00 */
  USART1->DR;   /*!< USART Data register,                     Address offset: 0x04 */
  USART1->BRR;  /*!< USART Baud rate register,                Address offset: 0x08 */
  USART1->CR1;  /*!< USART Control register 1,                Address offset: 0x0C */
  USART1->CR2;  /*!< USART Control register 2,                Address offset: 0x10 */
  USART1->CR3;  /*!< USART Control register 3,                Address offset: 0x14 */
  USART1->GTPR; /*!< USART Guard time and prescaler register, Address offset: 0x18 */
  // USART_TypeDef;

  USART6->SR;   /*!< USART Status register,                   Address offset: 0x00 */
  USART6->DR;   /*!< USART Data register,                     Address offset: 0x04 */
  USART6->BRR;  /*!< USART Baud rate register,                Address offset: 0x08 */
  USART6->CR1;  /*!< USART Control register 1,                Address offset: 0x0C */
  USART6->CR2;  /*!< USART Control register 2,                Address offset: 0x10 */
  USART6->CR3;  /*!< USART Control register 3,                Address offset: 0x14 */
  USART6->GTPR; /*!< USART Guard time and prescaler register, Address offset: 0x18 */
  // USART_TypeDef;

  UART9->SR;   /*!< USART Status register,                   Address offset: 0x00 */
  UART9->DR;   /*!< USART Data register,                     Address offset: 0x04 */
  UART9->BRR;  /*!< USART Baud rate register,                Address offset: 0x08 */
  UART9->CR1;  /*!< USART Control register 1,                Address offset: 0x0C */
  UART9->CR2;  /*!< USART Control register 2,                Address offset: 0x10 */
  UART9->CR3;  /*!< USART Control register 3,                Address offset: 0x14 */
  UART9->GTPR; /*!< USART Guard time and prescaler register, Address offset: 0x18 */
  // USART_TypeDef;

  UART10->SR;   /*!< USART Status register,                   Address offset: 0x00 */
  UART10->DR;   /*!< USART Data register,                     Address offset: 0x04 */
  UART10->BRR;  /*!< USART Baud rate register,                Address offset: 0x08 */
  UART10->CR1;  /*!< USART Control register 1,                Address offset: 0x0C */
  UART10->CR2;  /*!< USART Control register 2,                Address offset: 0x10 */
  UART10->CR3;  /*!< USART Control register 3,                Address offset: 0x14 */
  UART10->GTPR; /*!< USART Guard time and prescaler register, Address offset: 0x18 */
  // USART_TypeDef;
  /**
   * @brief Window WATCHDOG
   */

  WWDG->CR;  /*!< WWDG Control register,       Address offset: 0x00 */
  WWDG->CFR; /*!< WWDG Configuration register, Address offset: 0x04 */
  WWDG->SR;  /*!< WWDG Status register,        Address offset: 0x08 */
  // WWDG_TypeDef;

  /**
   * @brief RNG
   */

  RNG->CR; /*!< RNG control register, Address offset: 0x00 */
  RNG->SR; /*!< RNG status register,  Address offset: 0x04 */
  RNG->DR; /*!< RNG data register,    Address offset: 0x08 */
  // RNG_TypeDef;

  /**
   * @brief USB_OTG_Core_Registers
   */

  USB_OTG_FS->GOTGCTL;            /*!< USB_OTG Control and Status Register          Address offset: 0x00  */
  USB_OTG_FS->GOTGINT;            /*!< USB_OTG Interrupt Register                   Address offset: 0x04  */
  USB_OTG_FS->GAHBCFG;            /*!< Core AHB Configuration Register              Address offset: 0x08  */
  USB_OTG_FS->GUSBCFG;            /*!< Core USB Configuration Register              Address offset: 0x0C  */
  USB_OTG_FS->GRSTCTL;            /*!< Core Reset Register                          Address offset: 0x10  */
  USB_OTG_FS->GINTSTS;            /*!< Core Interrupt Register                      Address offset: 0x14  */
  USB_OTG_FS->GINTMSK;            /*!< Core Interrupt Mask Register                 Address offset: 0x18  */
  USB_OTG_FS->GRXSTSR;            /*!< Receive Sts Q Read Register                  Address offset: 0x1C  */
  USB_OTG_FS->GRXSTSP;            /*!< Receive Sts Q Read & POP Register            Address offset: 0x20  */
  USB_OTG_FS->GRXFSIZ;            /*!< Receive FIFO Size Register                   Address offset: 0x24  */
  USB_OTG_FS->DIEPTXF0_HNPTXFSIZ; /*!< EP0 / Non Periodic Tx FIFO Size Register     Address offset: 0x28  */
  USB_OTG_FS->HNPTXSTS;           /*!< Non Periodic Tx FIFO/Queue Sts reg           Address offset: 0x2C  */
  USB_OTG_FS->GCCFG;              /*!< General Purpose IO Register                  Address offset: 0x38  */
  USB_OTG_FS->CID;                /*!< User ID Register                             Address offset: 0x3C  */
  USB_OTG_FS->GHWCFG3;            /*!< User HW config3                              Address offset: 0x4C  */
  USB_OTG_FS->GLPMCFG;            /*!< LPM Register                                 Address offset: 0x54  */
  USB_OTG_FS->GDFIFOCFG;          /*!< DFIFO Software Config Register               Address offset: 0x5C  */
  USB_OTG_FS->HPTXFSIZ;           /*!< Host Periodic Tx FIFO Size Reg               Address offset: 0x100 */
  USB_OTG_FS->DIEPTXF[0];         /*!< dev Periodic Transmit FIFO                   Address offset: 0x104 */
  USB_OTG_FS->DIEPTXF[1];         /*!< dev Periodic Transmit FIFO                   Address offset: 0x108 */
  USB_OTG_FS->DIEPTXF[2];         /*!< dev Periodic Transmit FIFO                   Address offset: 0x10C */
  USB_OTG_FS->DIEPTXF[3];         /*!< dev Periodic Transmit FIFO                   Address offset: 0x110 */
  USB_OTG_FS->DIEPTXF[4];         /*!< dev Periodic Transmit FIFO                   Address offset: 0x114 */
  USB_OTG_FS->DIEPTXF[5];         /*!< dev Periodic Transmit FIFO                   Address offset: 0x118 */
  USB_OTG_FS->DIEPTXF[6];         /*!< dev Periodic Transmit FIFO                   Address offset: 0x11C */
  USB_OTG_FS->DIEPTXF[7];         /*!< dev Periodic Transmit FIFO                   Address offset: 0x120 */
  USB_OTG_FS->DIEPTXF[8];         /*!< dev Periodic Transmit FIFO                   Address offset: 0x124 */
  USB_OTG_FS->DIEPTXF[9];         /*!< dev Periodic Transmit FIFO                   Address offset: 0x128 */
  USB_OTG_FS->DIEPTXF[10];        /*!< dev Periodic Transmit FIFO                   Address offset: 0x12C */
  USB_OTG_FS->DIEPTXF[11];        /*!< dev Periodic Transmit FIFO                   Address offset: 0x130 */
  USB_OTG_FS->DIEPTXF[12];        /*!< dev Periodic Transmit FIFO                   Address offset: 0x134 */
  USB_OTG_FS->DIEPTXF[13];        /*!< dev Periodic Transmit FIFO                   Address offset: 0x138 */
  USB_OTG_FS->DIEPTXF[14];        /*!< dev Periodic Transmit FIFO                   Address offset: 0x13C */
                                  // USB_OTG_GlobalTypeDef;

  /**
   * @brief LPTIMER
   */

  LPTIM1->ISR;  /*!< LPTIM Interrupt and Status register,                Address offset: 0x00 */
  LPTIM1->ICR;  /*!< LPTIM Interrupt Clear register,                     Address offset: 0x04 */
  LPTIM1->IER;  /*!< LPTIM Interrupt Enable register,                    Address offset: 0x08 */
  LPTIM1->CFGR; /*!< LPTIM Configuration register,                       Address offset: 0x0C */
  LPTIM1->CR;   /*!< LPTIM Control register,                             Address offset: 0x10 */
  LPTIM1->CMP;  /*!< LPTIM Compare register,                             Address offset: 0x14 */
  LPTIM1->ARR;  /*!< LPTIM Autoreload register,                          Address offset: 0x18 */
  LPTIM1->CNT;  /*!< LPTIM Counter register,                             Address offset: 0x1C */
  LPTIM1->OR;   /*!< LPTIM Option register,                              Address offset: 0x20 */
  // LPTIM_TypeDef;
}